wdxm657/esp32c3_gh3036_8/components/gh3036_sdk/gh_hal/hw_interface/inc/gh3036_reg.h
#ifndef __GH3036_REG_H__
#define __GH3036_REG_H__

#ifdef __cplusplus
extern "C"
{
#endif

#define RG_VENDER_ID_L_ADDR                                (0x0000)
#define RG_VENDER_ID_L_LSB                                 (0)
#define RG_VENDER_ID_L_MSB                                 (15)
#define RG_VENDER_ID_H_ADDR                                (0x0002)
#define RG_VENDER_ID_H_LSB                                 (0)
#define RG_VENDER_ID_H_MSB                                 (15)
#define CHIP_NAME_L_ADDR                                   (0x0004)
#define CHIP_NAME_L_LSB                                    (0)
#define CHIP_NAME_L_MSB                                    (15)
#define CHIP_NAME_H_ADDR                                   (0x0006)
#define CHIP_NAME_H_LSB                                    (0)
#define CHIP_NAME_H_MSB                                    (7)
#define CHIP_VERSION_ADDR                                  (0x0006)
#define CHIP_VERSION_LSB                                   (8)
#define CHIP_VERSION_MSB                                   (15)
#define ANA_PRODUCT_ID_H_ADDR                              (0x0008)
#define ANA_PRODUCT_ID_H_LSB                               (0)
#define ANA_PRODUCT_ID_H_MSB                               (15)
#define ANA_PRODUCT_ID_L_ADDR                              (0x000A)
#define ANA_PRODUCT_ID_L_LSB                               (0)
#define ANA_PRODUCT_ID_L_MSB                               (15)
#define ANA_CHIP_ID_ADDR                                   (0x000C)
#define ANA_CHIP_ID_LSB                                    (0)
#define ANA_CHIP_ID_MSB                                    (7)
#define RG_CLK_SEL_ADDR                                    (0x000E)
#define RG_CLK_SEL_LSB                                     (0)
#define RG_CLK_SEL_MSB                                     (0)
#define RG_FIFO_CLK_EN_ADDR                                (0x000E)
#define RG_FIFO_CLK_EN_LSB                                 (1)
#define RG_FIFO_CLK_EN_MSB                                 (1)
#define RG_FIFO_CKGT_EN_ADDR                               (0x000E)
#define RG_FIFO_CKGT_EN_LSB                                (2)
#define RG_FIFO_CKGT_EN_MSB                                (2)
#define RG_EFUSE_CLK_EN_ADDR                               (0x000E)
#define RG_EFUSE_CLK_EN_LSB                                (3)
#define RG_EFUSE_CLK_EN_MSB                                (3)
#define RG_REG_CTRL_CKGT_EN_ADDR                           (0x000E)
#define RG_REG_CTRL_CKGT_EN_LSB                            (4)
#define RG_REG_CTRL_CKGT_EN_MSB                            (4)
#define RG_CLK13M_MPX_SEL_ADDR                             (0x000E)
#define RG_CLK13M_MPX_SEL_LSB                              (5)
#define RG_CLK13M_MPX_SEL_MSB                              (5)
#define RG_TOP_START_ADDR                                  (0x0010)
#define RG_TOP_START_LSB                                   (0)
#define RG_TOP_START_MSB                                   (0)
#define RG_NO_SLEEP_ADDR                                   (0x0012)
#define RG_NO_SLEEP_LSB                                    (1)
#define RG_NO_SLEEP_MSB                                    (1)
#define RG_SYNC_MODE_ADDR                                  (0x0012)
#define RG_SYNC_MODE_LSB                                   (2)
#define RG_SYNC_MODE_MSB                                   (3)
#define RG_SYNC_OUT_MODE_ADDR                              (0x0012)
#define RG_SYNC_OUT_MODE_LSB                               (4)
#define RG_SYNC_OUT_MODE_MSB                               (4)
#define RG_INT_PWRUP_ADDR                                  (0x0012)
#define RG_INT_PWRUP_LSB                                   (5)
#define RG_INT_PWRUP_MSB                                   (5)
#define RG_FRAME_TRIGGER_START_ADDR                        (0x0012)
#define RG_FRAME_TRIGGER_START_LSB                         (6)
#define RG_FRAME_TRIGGER_START_MSB                         (6)
#define RG_PMU_WKUP_TIME_ADDR                              (0x0012)
#define RG_PMU_WKUP_TIME_LSB                               (8)
#define RG_PMU_WKUP_TIME_MSB                               (13)
#define RG_FRAME_SYNC_T1_SET_ADDR                          (0x0014)
#define RG_FRAME_SYNC_T1_SET_LSB                           (0)
#define RG_FRAME_SYNC_T1_SET_MSB                           (6)
#define RG_FRAME_SYNC_T2_SET_ADDR                          (0x0014)
#define RG_FRAME_SYNC_T2_SET_LSB                           (8)
#define RG_FRAME_SYNC_T2_SET_MSB                           (14)
#define RG_FASTEST_SAMPLE_RATE_ADDR                        (0x0016)
#define RG_FASTEST_SAMPLE_RATE_LSB                         (0)
#define RG_FASTEST_SAMPLE_RATE_MSB                         (14)
#define RG_WDT_EN_ADDR                                     (0x0018)
#define RG_WDT_EN_LSB                                      (0)
#define RG_WDT_EN_MSB                                      (0)
#define RG_WDT_REFRESH_ADDR                                (0x0018)
#define RG_WDT_REFRESH_LSB                                 (1)
#define RG_WDT_REFRESH_MSB                                 (1)
#define RG_WDT_INIT_TIME_ADDR                              (0x0018)
#define RG_WDT_INIT_TIME_LSB                               (2)
#define RG_WDT_INIT_TIME_MSB                               (3)
#define RG_WDT_CLOSE_TIME_ADDR                             (0x0018)
#define RG_WDT_CLOSE_TIME_LSB                              (4)
#define RG_WDT_CLOSE_TIME_MSB                              (6)
#define RG_WDT_OPEN_TIME_ADDR                              (0x0018)
#define RG_WDT_OPEN_TIME_LSB                               (8)
#define RG_WDT_OPEN_TIME_MSB                               (10)
#define RG_MPX_ALON_SEL0_ADDR                              (0x001A)
#define RG_MPX_ALON_SEL0_LSB                               (0)
#define RG_MPX_ALON_SEL0_MSB                               (5)
#define RG_MPX_ALON_SEL1_ADDR                              (0x001A)
#define RG_MPX_ALON_SEL1_LSB                               (8)
#define RG_MPX_ALON_SEL1_MSB                               (13)
#define RG_MPX_SHUT_SEL0_ADDR                              (0x001C)
#define RG_MPX_SHUT_SEL0_LSB                               (0)
#define RG_MPX_SHUT_SEL0_MSB                               (4)
#define RG_MPX_SHUT_SEL1_ADDR                              (0x001C)
#define RG_MPX_SHUT_SEL1_LSB                               (8)
#define RG_MPX_SHUT_SEL1_MSB                               (12)
#define RG_DFT_TEST_EN_ADDR                                (0x001E)
#define RG_DFT_TEST_EN_LSB                                 (0)
#define RG_DFT_TEST_EN_MSB                                 (0)
#define RG_BIST_EN_ADDR                                    (0x001E)
#define RG_BIST_EN_LSB                                     (1)
#define RG_BIST_EN_MSB                                     (1)
#define RG_BIST_RSTN_ADDR                                  (0x001E)
#define RG_BIST_RSTN_LSB                                   (2)
#define RG_BIST_RSTN_MSB                                   (2)
#define RG_BIST_ERR_ADDR                                   (0x001E)
#define RG_BIST_ERR_LSB                                    (3)
#define RG_BIST_ERR_MSB                                    (3)
#define RG_BIST_DONE_ADDR                                  (0x001E)
#define RG_BIST_DONE_LSB                                   (4)
#define RG_BIST_DONE_MSB                                   (4)
#define RG_FIFO_WATERLINE_ADDR                             (0x0020)
#define RG_FIFO_WATERLINE_LSB                              (0)
#define RG_FIFO_WATERLINE_MSB                              (7)
#define RG_FIFO_USE_REAL_EN_ADDR                           (0x0020)
#define RG_FIFO_USE_REAL_EN_LSB                            (8)
#define RG_FIFO_USE_REAL_EN_MSB                            (8)
#define RG_FIFO_WATERLINE_INT_TIMER_ADDR                   (0x0020)
#define RG_FIFO_WATERLINE_INT_TIMER_LSB                    (10)
#define RG_FIFO_WATERLINE_INT_TIMER_MSB                    (11)
#define RG_FIFO_READ_INT_TIMER_ADDR                        (0x0020)
#define RG_FIFO_READ_INT_TIMER_LSB                         (12)
#define RG_FIFO_READ_INT_TIMER_MSB                         (13)
#define RG_FIFO_O_USED_ADDR                                (0x0022)
#define RG_FIFO_O_USED_LSB                                 (0)
#define RG_FIFO_O_USED_MSB                                 (8)
#define RG_FIFO_O_USED_REAL_ADDR                           (0x0024)
#define RG_FIFO_O_USED_REAL_LSB                            (0)
#define RG_FIFO_O_USED_REAL_MSB                            (8)
#define RG_DATACTRL_CKGT_EN_ADDR                           (0x0026)
#define RG_DATACTRL_CKGT_EN_LSB                            (0)
#define RG_DATACTRL_CKGT_EN_MSB                            (0)
#define RG_CHECK_BIT_EN_ADDR                               (0x0026)
#define RG_CHECK_BIT_EN_LSB                                (1)
#define RG_CHECK_BIT_EN_MSB                                (1)
#define BANDGAP_VCM_QM_REG0_ADDR                           (0x0028)
#define BANDGAP_VCM_QM_REG0_LSB                            (0)
#define BANDGAP_VCM_QM_REG0_MSB                            (0)
#define BANDGAP_VCM_QM_REG1_ADDR                           (0x002A)
#define BANDGAP_VCM_QM_REG1_LSB                            (0)
#define BANDGAP_VCM_QM_REG1_MSB                            (0)
#define RG_CHIP_READY_CODE_ADDR                            (0x002C)
#define RG_CHIP_READY_CODE_LSB                             (0)
#define RG_CHIP_READY_CODE_MSB                             (15)
#define RG_CHIP_SW_BACKUP_ADDR                             (0x002E)
#define RG_CHIP_SW_BACKUP_LSB                              (0)
#define RG_CHIP_SW_BACKUP_MSB                              (15)
#define RG_CHIP_ECO_RESERVE_ADDR                           (0x0030)
#define RG_CHIP_ECO_RESERVE_LSB                            (0)
#define RG_CHIP_ECO_RESERVE_MSB                            (15)
#define RG_RSV_ADDR                                        (0x0032)
#define RG_RSV_LSB                                         (0)
#define RG_RSV_MSB                                         (15)
#define RG_VCM_PULSEMODE_ADDR                              (0x0080)
#define RG_VCM_PULSEMODE_LSB                               (0)
#define RG_VCM_PULSEMODE_MSB                               (0)
#define RG_PMU_FIFOCUT_ADDR                                (0x0080)
#define RG_PMU_FIFOCUT_LSB                                 (1)
#define RG_PMU_FIFOCUT_MSB                                 (1)
#define RG_TIMING_VCM_ADDR                                 (0x0080)
#define RG_TIMING_VCM_LSB                                  (2)
#define RG_TIMING_VCM_MSB                                  (3)
#define RG_TIMING_LDO_ADDR                                 (0x0080)
#define RG_TIMING_LDO_LSB                                  (4)
#define RG_TIMING_LDO_MSB                                  (6)
#define RG_FASTER_SR_NOSLEEP_ADDR                          (0x0080)
#define RG_FASTER_SR_NOSLEEP_LSB                           (7)
#define RG_FASTER_SR_NOSLEEP_MSB                           (7)
#define RG_PMU_FAST_WAKEUP_ADDR                            (0x0080)
#define RG_PMU_FAST_WAKEUP_LSB                             (8)
#define RG_PMU_FAST_WAKEUP_MSB                             (8)
#define RG_LDO_MANUAL_MODE_ADDR                            (0x0080)
#define RG_LDO_MANUAL_MODE_LSB                             (9)
#define RG_LDO_MANUAL_MODE_MSB                             (9)
#define RG_DA_LDOVREF_POW_ADDR                             (0x0080)
#define RG_DA_LDOVREF_POW_LSB                              (10)
#define RG_DA_LDOVREF_POW_MSB                              (10)
#define RG_DA_VCM_PULSEMODE_ADDR                           (0x0080)
#define RG_DA_VCM_PULSEMODE_LSB                            (11)
#define RG_DA_VCM_PULSEMODE_MSB                            (11)
#define RG_IB_TOTAL_ADDR                                   (0x0082)
#define RG_IB_TOTAL_LSB                                    (0)
#define RG_IB_TOTAL_MSB                                    (1)
#define RG_IB_ADC_OPA1_ADDR                                (0x0082)
#define RG_IB_ADC_OPA1_LSB                                 (2)
#define RG_IB_ADC_OPA1_MSB                                 (3)
#define RG_IB_ADC_OPA2_ADDR                                (0x0082)
#define RG_IB_ADC_OPA2_LSB                                 (4)
#define RG_IB_ADC_OPA2_MSB                                 (5)
#define RG_IB_ADC_SUM_ADDR                                 (0x0082)
#define RG_IB_ADC_SUM_LSB                                  (6)
#define RG_IB_ADC_SUM_MSB                                  (7)
#define RG_IB_ADC_VCMB_ADDR                                (0x0082)
#define RG_IB_ADC_VCMB_LSB                                 (8)
#define RG_IB_ADC_VCMB_MSB                                 (9)
#define RG_IB_TIA_ADDR                                     (0x0082)
#define RG_IB_TIA_LSB                                      (10)
#define RG_IB_TIA_MSB                                      (11)
#define RG_IB_ADCBUF_ADDR                                  (0x0082)
#define RG_IB_ADCBUF_LSB                                   (12)
#define RG_IB_ADCBUF_MSB                                   (13)
#define RG_IB_DAC_OPA_ADDR                                 (0x0082)
#define RG_IB_DAC_OPA_LSB                                  (14)
#define RG_IB_DAC_OPA_MSB                                  (15)
#define RG_IB_DAC_KDC_ADDR                                 (0x0084)
#define RG_IB_DAC_KDC_LSB                                  (0)
#define RG_IB_DAC_KDC_MSB                                  (1)
#define RG_IB_LDOVREF_OPA_ADDR                             (0x0084)
#define RG_IB_LDOVREF_OPA_LSB                              (2)
#define RG_IB_LDOVREF_OPA_MSB                              (3)
#define RG_IB_LDOVREF_OCP_ADDR                             (0x0084)
#define RG_IB_LDOVREF_OCP_LSB                              (4)
#define RG_IB_LDOVREF_OCP_MSB                              (5)
#define RG_IB_OSC13M_ADDR                                  (0x0084)
#define RG_IB_OSC13M_LSB                                   (6)
#define RG_IB_OSC13M_MSB                                   (7)
#define RG_IB_LED_CH0_ADDR                                 (0x0084)
#define RG_IB_LED_CH0_LSB                                  (8)
#define RG_IB_LED_CH0_MSB                                  (9)
#define RG_IB_LED_CH1_ADDR                                 (0x0084)
#define RG_IB_LED_CH1_LSB                                  (10)
#define RG_IB_LED_CH1_MSB                                  (11)
#define RG_IB_CAP1_ADDR                                    (0x0086)
#define RG_IB_CAP1_LSB                                     (0)
#define RG_IB_CAP1_MSB                                     (1)
#define RG_IB_CAP2_ADDR                                    (0x0086)
#define RG_IB_CAP2_LSB                                     (2)
#define RG_IB_CAP2_MSB                                     (3)
#define RG_IB_CAP3_ADDR                                    (0x0086)
#define RG_IB_CAP3_LSB                                     (4)
#define RG_IB_CAP3_MSB                                     (5)
#define RG_IB_CAP4_ADDR                                    (0x0086)
#define RG_IB_CAP4_LSB                                     (6)
#define RG_IB_CAP4_MSB                                     (7)
#define RG_IB_CAP5_ADDR                                    (0x0086)
#define RG_IB_CAP5_LSB                                     (8)
#define RG_IB_CAP5_MSB                                     (9)
#define RG_IB_CAP6_ADDR                                    (0x0086)
#define RG_IB_CAP6_LSB                                     (10)
#define RG_IB_CAP6_MSB                                     (11)
#define RG_IB_CAP7_ADDR                                    (0x0086)
#define RG_IB_CAP7_LSB                                     (12)
#define RG_IB_CAP7_MSB                                     (13)
#define RG_IB_CAP8_ADDR                                    (0x0086)
#define RG_IB_CAP8_LSB                                     (14)
#define RG_IB_CAP8_MSB                                     (15)
#define RG_OSC32K_COARSE_ADDR                              (0x0088)
#define RG_OSC32K_COARSE_LSB                               (0)
#define RG_OSC32K_COARSE_MSB                               (7)
#define RG_OSC32K_FINE_ADDR                                (0x0088)
#define RG_OSC32K_FINE_LSB                                 (8)
#define RG_OSC32K_FINE_MSB                                 (13)
#define RG_OSC32K_TEMP_ADDR                                (0x008A)
#define RG_OSC32K_TEMP_LSB                                 (0)
#define RG_OSC32K_TEMP_MSB                                 (3)
#define RG_OSC13M_TUNE_ADDR                                (0x008C)
#define RG_OSC13M_TUNE_LSB                                 (0)
#define RG_OSC13M_TUNE_MSB                                 (5)
#define RG_VCM_VBG_ADDR                                    (0x008E)
#define RG_VCM_VBG_LSB                                     (0)
#define RG_VCM_VBG_MSB                                     (1)
#define RG_VCM_VBGLP_ADDR                                  (0x008E)
#define RG_VCM_VBGLP_LSB                                   (2)
#define RG_VCM_VBGLP_MSB                                   (3)
#define RG_VCM_OFF_FLOAT_ADDR                              (0x008E)
#define RG_VCM_OFF_FLOAT_LSB                               (4)
#define RG_VCM_OFF_FLOAT_MSB                               (4)
#define RG_VCM_OTD_EN_ADDR                                 (0x008E)
#define RG_VCM_OTD_EN_LSB                                  (5)
#define RG_VCM_OTD_EN_MSB                                  (5)
#define RG_VCM_OT_ADDR                                     (0x008E)
#define RG_VCM_OT_LSB                                      (6)
#define RG_VCM_OT_MSB                                      (8)
#define RG_SLOT_INDEX0_ADDR                                (0x0380)
#define RG_SLOT_INDEX0_LSB                                 (0)
#define RG_SLOT_INDEX0_MSB                                 (3)
#define RG_SLOT_INDEX1_ADDR                                (0x0380)
#define RG_SLOT_INDEX1_LSB                                 (4)
#define RG_SLOT_INDEX1_MSB                                 (7)
#define RG_SLOT_INDEX2_ADDR                                (0x0380)
#define RG_SLOT_INDEX2_LSB                                 (8)
#define RG_SLOT_INDEX2_MSB                                 (11)
#define RG_SLOT_INDEX3_ADDR                                (0x0380)
#define RG_SLOT_INDEX3_LSB                                 (12)
#define RG_SLOT_INDEX3_MSB                                 (15)
#define RG_SLOT_INDEX4_ADDR                                (0x0382)
#define RG_SLOT_INDEX4_LSB                                 (0)
#define RG_SLOT_INDEX4_MSB                                 (3)
#define RG_SLOT_INDEX5_ADDR                                (0x0382)
#define RG_SLOT_INDEX5_LSB                                 (4)
#define RG_SLOT_INDEX5_MSB                                 (7)
#define RG_SLOT_INDEX6_ADDR                                (0x0382)
#define RG_SLOT_INDEX6_LSB                                 (8)
#define RG_SLOT_INDEX6_MSB                                 (11)
#define RG_SLOT_INDEX7_ADDR                                (0x0382)
#define RG_SLOT_INDEX7_LSB                                 (12)
#define RG_SLOT_INDEX7_MSB                                 (15)
#define RG_SLOT_INDEX8_ADDR                                (0x0384)
#define RG_SLOT_INDEX8_LSB                                 (0)
#define RG_SLOT_INDEX8_MSB                                 (3)
#define RG_SLOT_EN_ADDR                                    (0x0386)
#define RG_SLOT_EN_LSB                                     (0)
#define RG_SLOT_EN_MSB                                     (8)
#define RG_SLOT_SYNC_OUT_EN_ADDR                           (0x0388)
#define RG_SLOT_SYNC_OUT_EN_LSB                            (0)
#define RG_SLOT_SYNC_OUT_EN_MSB                            (8)
#define RG_RX_EN_0_ADDR                                    (0x038A)
#define RG_RX_EN_0_LSB                                     (0)
#define RG_RX_EN_0_MSB                                     (1)
#define RG_FIFO_CTRL_0_ADDR                                (0x038A)
#define RG_FIFO_CTRL_0_LSB                                 (2)
#define RG_FIFO_CTRL_0_MSB                                 (3)
#define RG_SR_MULTIPLIER_0_ADDR                            (0x038A)
#define RG_SR_MULTIPLIER_0_LSB                             (4)
#define RG_SR_MULTIPLIER_0_MSB                             (12)
#define RG_RX_EN_1_ADDR                                    (0x038C)
#define RG_RX_EN_1_LSB                                     (0)
#define RG_RX_EN_1_MSB                                     (1)
#define RG_FIFO_CTRL_1_ADDR                                (0x038C)
#define RG_FIFO_CTRL_1_LSB                                 (2)
#define RG_FIFO_CTRL_1_MSB                                 (3)
#define RG_SR_MULTIPLIER_1_ADDR                            (0x038C)
#define RG_SR_MULTIPLIER_1_LSB                             (4)
#define RG_SR_MULTIPLIER_1_MSB                             (12)
#define RG_RX_EN_2_ADDR                                    (0x038E)
#define RG_RX_EN_2_LSB                                     (0)
#define RG_RX_EN_2_MSB                                     (1)
#define RG_FIFO_CTRL_2_ADDR                                (0x038E)
#define RG_FIFO_CTRL_2_LSB                                 (2)
#define RG_FIFO_CTRL_2_MSB                                 (3)
#define RG_SR_MULTIPLIER_2_ADDR                            (0x038E)
#define RG_SR_MULTIPLIER_2_LSB                             (4)
#define RG_SR_MULTIPLIER_2_MSB                             (12)
#define RG_RX_EN_3_ADDR                                    (0x0390)
#define RG_RX_EN_3_LSB                                     (0)
#define RG_RX_EN_3_MSB                                     (1)
#define RG_FIFO_CTRL_3_ADDR                                (0x0390)
#define RG_FIFO_CTRL_3_LSB                                 (2)
#define RG_FIFO_CTRL_3_MSB                                 (3)
#define RG_SR_MULTIPLIER_3_ADDR                            (0x0390)
#define RG_SR_MULTIPLIER_3_LSB                             (4)
#define RG_SR_MULTIPLIER_3_MSB                             (12)
#define RG_RX_EN_4_ADDR                                    (0x0392)
#define RG_RX_EN_4_LSB                                     (0)
#define RG_RX_EN_4_MSB                                     (1)
#define RG_FIFO_CTRL_4_ADDR                                (0x0392)
#define RG_FIFO_CTRL_4_LSB                                 (2)
#define RG_FIFO_CTRL_4_MSB                                 (3)
#define RG_SR_MULTIPLIER_4_ADDR                            (0x0392)
#define RG_SR_MULTIPLIER_4_LSB                             (4)
#define RG_SR_MULTIPLIER_4_MSB                             (12)
#define RG_RX_EN_5_ADDR                                    (0x0394)
#define RG_RX_EN_5_LSB                                     (0)
#define RG_RX_EN_5_MSB                                     (1)
#define RG_FIFO_CTRL_5_ADDR                                (0x0394)
#define RG_FIFO_CTRL_5_LSB                                 (2)
#define RG_FIFO_CTRL_5_MSB                                 (3)
#define RG_SR_MULTIPLIER_5_ADDR                            (0x0394)
#define RG_SR_MULTIPLIER_5_LSB                             (4)
#define RG_SR_MULTIPLIER_5_MSB                             (12)
