wdxm657/esp32c3_gh3036_8/components/gh3036_sdk/gh_hal/hw_interface/inc/gh3036_reg.h
#define RG_RX_EN_6_ADDR                                    (0x0396)
#define RG_RX_EN_6_LSB                                     (0)
#define RG_RX_EN_6_MSB                                     (1)
#define RG_FIFO_CTRL_6_ADDR                                (0x0396)
#define RG_FIFO_CTRL_6_LSB                                 (2)
#define RG_FIFO_CTRL_6_MSB                                 (3)
#define RG_SR_MULTIPLIER_6_ADDR                            (0x0396)
#define RG_SR_MULTIPLIER_6_LSB                             (4)
#define RG_SR_MULTIPLIER_6_MSB                             (12)
#define RG_RX_EN_7_ADDR                                    (0x0398)
#define RG_RX_EN_7_LSB                                     (0)
#define RG_RX_EN_7_MSB                                     (1)
#define RG_FIFO_CTRL_7_ADDR                                (0x0398)
#define RG_FIFO_CTRL_7_LSB                                 (2)
#define RG_FIFO_CTRL_7_MSB                                 (3)
#define RG_SR_MULTIPLIER_7_ADDR                            (0x0398)
#define RG_SR_MULTIPLIER_7_LSB                             (4)
#define RG_SR_MULTIPLIER_7_MSB                             (12)
#define RG_RX0_PD_MAP_0_ADDR                               (0x039A)
#define RG_RX0_PD_MAP_0_LSB                                (0)
#define RG_RX0_PD_MAP_0_MSB                                (3)
#define RG_RX1_PD_MAP_0_ADDR                               (0x039A)
#define RG_RX1_PD_MAP_0_LSB                                (4)
#define RG_RX1_PD_MAP_0_MSB                                (7)
#define RG_RX0_PD_MAP_1_ADDR                               (0x039C)
#define RG_RX0_PD_MAP_1_LSB                                (0)
#define RG_RX0_PD_MAP_1_MSB                                (3)
#define RG_RX1_PD_MAP_1_ADDR                               (0x039C)
#define RG_RX1_PD_MAP_1_LSB                                (4)
#define RG_RX1_PD_MAP_1_MSB                                (7)
#define RG_RX0_PD_MAP_2_ADDR                               (0x039E)
#define RG_RX0_PD_MAP_2_LSB                                (0)
#define RG_RX0_PD_MAP_2_MSB                                (3)
#define RG_RX1_PD_MAP_2_ADDR                               (0x039E)
#define RG_RX1_PD_MAP_2_LSB                                (4)
#define RG_RX1_PD_MAP_2_MSB                                (7)
#define RG_RX0_PD_MAP_3_ADDR                               (0x03A0)
#define RG_RX0_PD_MAP_3_LSB                                (0)
#define RG_RX0_PD_MAP_3_MSB                                (3)
#define RG_RX1_PD_MAP_3_ADDR                               (0x03A0)
#define RG_RX1_PD_MAP_3_LSB                                (4)
#define RG_RX1_PD_MAP_3_MSB                                (7)
#define RG_RX0_PD_MAP_4_ADDR                               (0x03A2)
#define RG_RX0_PD_MAP_4_LSB                                (0)
#define RG_RX0_PD_MAP_4_MSB                                (3)
#define RG_RX1_PD_MAP_4_ADDR                               (0x03A2)
#define RG_RX1_PD_MAP_4_LSB                                (4)
#define RG_RX1_PD_MAP_4_MSB                                (7)
#define RG_RX0_PD_MAP_5_ADDR                               (0x03A4)
#define RG_RX0_PD_MAP_5_LSB                                (0)
#define RG_RX0_PD_MAP_5_MSB                                (3)
#define RG_RX1_PD_MAP_5_ADDR                               (0x03A4)
#define RG_RX1_PD_MAP_5_LSB                                (4)
#define RG_RX1_PD_MAP_5_MSB                                (7)
#define RG_RX0_PD_MAP_6_ADDR                               (0x03A6)
#define RG_RX0_PD_MAP_6_LSB                                (0)
#define RG_RX0_PD_MAP_6_MSB                                (3)
#define RG_RX1_PD_MAP_6_ADDR                               (0x03A6)
#define RG_RX1_PD_MAP_6_LSB                                (4)
#define RG_RX1_PD_MAP_6_MSB                                (7)
#define RG_RX0_PD_MAP_7_ADDR                               (0x03A8)
#define RG_RX0_PD_MAP_7_LSB                                (0)
#define RG_RX0_PD_MAP_7_MSB                                (3)
#define RG_RX1_PD_MAP_7_ADDR                               (0x03A8)
#define RG_RX1_PD_MAP_7_LSB                                (4)
#define RG_RX1_PD_MAP_7_MSB                                (7)
#define RG_ADC_INT_0_ADDR                                  (0x03AA)
#define RG_ADC_INT_0_LSB                                   (0)
#define RG_ADC_INT_0_MSB                                   (3)
#define RG_DC_DAC_EN_0_ADDR                                (0x03AA)
#define RG_DC_DAC_EN_0_LSB                                 (4)
#define RG_DC_DAC_EN_0_MSB                                 (4)
#define RG_AMB_DAC_EN_0_ADDR                               (0x03AA)
#define RG_AMB_DAC_EN_0_LSB                                (5)
#define RG_AMB_DAC_EN_0_MSB                                (5)
#define RG_BG_LEVEL_0_ADDR                                 (0x03AA)
#define RG_BG_LEVEL_0_LSB                                  (6)
#define RG_BG_LEVEL_0_MSB                                  (7)
#define RG_RX0_TIA_GAIN_0_ADDR                             (0x03AA)
#define RG_RX0_TIA_GAIN_0_LSB                              (8)
#define RG_RX0_TIA_GAIN_0_MSB                              (10)
#define RG_RX1_TIA_GAIN_0_ADDR                             (0x03AA)
#define RG_RX1_TIA_GAIN_0_LSB                              (12)
#define RG_RX1_TIA_GAIN_0_MSB                              (14)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_0_ADDR                (0x03AA)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_0_LSB                 (15)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_0_MSB                 (15)
#define RG_ADC_INT_1_ADDR                                  (0x03AC)
#define RG_ADC_INT_1_LSB                                   (0)
#define RG_ADC_INT_1_MSB                                   (3)
#define RG_DC_DAC_EN_1_ADDR                                (0x03AC)
#define RG_DC_DAC_EN_1_LSB                                 (4)
#define RG_DC_DAC_EN_1_MSB                                 (4)
#define RG_AMB_DAC_EN_1_ADDR                               (0x03AC)
#define RG_AMB_DAC_EN_1_LSB                                (5)
#define RG_AMB_DAC_EN_1_MSB                                (5)
#define RG_BG_LEVEL_1_ADDR                                 (0x03AC)
#define RG_BG_LEVEL_1_LSB                                  (6)
#define RG_BG_LEVEL_1_MSB                                  (7)
#define RG_RX0_TIA_GAIN_1_ADDR                             (0x03AC)
#define RG_RX0_TIA_GAIN_1_LSB                              (8)
#define RG_RX0_TIA_GAIN_1_MSB                              (10)
#define RG_RX1_TIA_GAIN_1_ADDR                             (0x03AC)
#define RG_RX1_TIA_GAIN_1_LSB                              (12)
#define RG_RX1_TIA_GAIN_1_MSB                              (14)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_1_ADDR                (0x03AC)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_1_LSB                 (15)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_1_MSB                 (15)
#define RG_ADC_INT_2_ADDR                                  (0x03AE)
#define RG_ADC_INT_2_LSB                                   (0)
#define RG_ADC_INT_2_MSB                                   (3)
#define RG_DC_DAC_EN_2_ADDR                                (0x03AE)
#define RG_DC_DAC_EN_2_LSB                                 (4)
#define RG_DC_DAC_EN_2_MSB                                 (4)
#define RG_AMB_DAC_EN_2_ADDR                               (0x03AE)
#define RG_AMB_DAC_EN_2_LSB                                (5)
#define RG_AMB_DAC_EN_2_MSB                                (5)
#define RG_BG_LEVEL_2_ADDR                                 (0x03AE)
#define RG_BG_LEVEL_2_LSB                                  (6)
#define RG_BG_LEVEL_2_MSB                                  (7)
#define RG_RX0_TIA_GAIN_2_ADDR                             (0x03AE)
#define RG_RX0_TIA_GAIN_2_LSB                              (8)
#define RG_RX0_TIA_GAIN_2_MSB                              (10)
#define RG_RX1_TIA_GAIN_2_ADDR                             (0x03AE)
#define RG_RX1_TIA_GAIN_2_LSB                              (12)
#define RG_RX1_TIA_GAIN_2_MSB                              (14)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_2_ADDR                (0x03AE)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_2_LSB                 (15)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_2_MSB                 (15)
#define RG_ADC_INT_3_ADDR                                  (0x03B0)
#define RG_ADC_INT_3_LSB                                   (0)
#define RG_ADC_INT_3_MSB                                   (3)
#define RG_DC_DAC_EN_3_ADDR                                (0x03B0)
#define RG_DC_DAC_EN_3_LSB                                 (4)
#define RG_DC_DAC_EN_3_MSB                                 (4)
#define RG_AMB_DAC_EN_3_ADDR                               (0x03B0)
#define RG_AMB_DAC_EN_3_LSB                                (5)
#define RG_AMB_DAC_EN_3_MSB                                (5)
#define RG_BG_LEVEL_3_ADDR                                 (0x03B0)
#define RG_BG_LEVEL_3_LSB                                  (6)
#define RG_BG_LEVEL_3_MSB                                  (7)
#define RG_RX0_TIA_GAIN_3_ADDR                             (0x03B0)
#define RG_RX0_TIA_GAIN_3_LSB                              (8)
#define RG_RX0_TIA_GAIN_3_MSB                              (10)
#define RG_RX1_TIA_GAIN_3_ADDR                             (0x03B0)
#define RG_RX1_TIA_GAIN_3_LSB                              (12)
#define RG_RX1_TIA_GAIN_3_MSB                              (14)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_3_ADDR                (0x03B0)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_3_LSB                 (15)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_3_MSB                 (15)
#define RG_ADC_INT_4_ADDR                                  (0x03B2)
#define RG_ADC_INT_4_LSB                                   (0)
#define RG_ADC_INT_4_MSB                                   (3)
#define RG_DC_DAC_EN_4_ADDR                                (0x03B2)
#define RG_DC_DAC_EN_4_LSB                                 (4)
#define RG_DC_DAC_EN_4_MSB                                 (4)
#define RG_AMB_DAC_EN_4_ADDR                               (0x03B2)
#define RG_AMB_DAC_EN_4_LSB                                (5)
#define RG_AMB_DAC_EN_4_MSB                                (5)
#define RG_BG_LEVEL_4_ADDR                                 (0x03B2)
#define RG_BG_LEVEL_4_LSB                                  (6)
#define RG_BG_LEVEL_4_MSB                                  (7)
#define RG_RX0_TIA_GAIN_4_ADDR                             (0x03B2)
#define RG_RX0_TIA_GAIN_4_LSB                              (8)
#define RG_RX0_TIA_GAIN_4_MSB                              (10)
#define RG_RX1_TIA_GAIN_4_ADDR                             (0x03B2)
#define RG_RX1_TIA_GAIN_4_LSB                              (12)
#define RG_RX1_TIA_GAIN_4_MSB                              (14)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_4_ADDR                (0x03B2)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_4_LSB                 (15)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_4_MSB                 (15)
#define RG_ADC_INT_5_ADDR                                  (0x03B4)
#define RG_ADC_INT_5_LSB                                   (0)
#define RG_ADC_INT_5_MSB                                   (3)
#define RG_DC_DAC_EN_5_ADDR                                (0x03B4)
#define RG_DC_DAC_EN_5_LSB                                 (4)
#define RG_DC_DAC_EN_5_MSB                                 (4)
#define RG_AMB_DAC_EN_5_ADDR                               (0x03B4)
#define RG_AMB_DAC_EN_5_LSB                                (5)
#define RG_AMB_DAC_EN_5_MSB                                (5)
#define RG_BG_LEVEL_5_ADDR                                 (0x03B4)
#define RG_BG_LEVEL_5_LSB                                  (6)
#define RG_BG_LEVEL_5_MSB                                  (7)
#define RG_RX0_TIA_GAIN_5_ADDR                             (0x03B4)
#define RG_RX0_TIA_GAIN_5_LSB                              (8)
#define RG_RX0_TIA_GAIN_5_MSB                              (10)
#define RG_RX1_TIA_GAIN_5_ADDR                             (0x03B4)
#define RG_RX1_TIA_GAIN_5_LSB                              (12)
#define RG_RX1_TIA_GAIN_5_MSB                              (14)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_5_ADDR                (0x03B4)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_5_LSB                 (15)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_5_MSB                 (15)
#define RG_ADC_INT_6_ADDR                                  (0x03B6)
#define RG_ADC_INT_6_LSB                                   (0)
#define RG_ADC_INT_6_MSB                                   (3)
#define RG_DC_DAC_EN_6_ADDR                                (0x03B6)
#define RG_DC_DAC_EN_6_LSB                                 (4)
#define RG_DC_DAC_EN_6_MSB                                 (4)
#define RG_AMB_DAC_EN_6_ADDR                               (0x03B6)
#define RG_AMB_DAC_EN_6_LSB                                (5)
#define RG_AMB_DAC_EN_6_MSB                                (5)
#define RG_BG_LEVEL_6_ADDR                                 (0x03B6)
#define RG_BG_LEVEL_6_LSB                                  (6)
#define RG_BG_LEVEL_6_MSB                                  (7)
#define RG_RX0_TIA_GAIN_6_ADDR                             (0x03B6)
#define RG_RX0_TIA_GAIN_6_LSB                              (8)
#define RG_RX0_TIA_GAIN_6_MSB                              (10)
#define RG_RX1_TIA_GAIN_6_ADDR                             (0x03B6)
#define RG_RX1_TIA_GAIN_6_LSB                              (12)
#define RG_RX1_TIA_GAIN_6_MSB                              (14)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_6_ADDR                (0x03B6)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_6_LSB                 (15)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_6_MSB                 (15)
#define RG_ADC_INT_7_ADDR                                  (0x03B8)
#define RG_ADC_INT_7_LSB                                   (0)
#define RG_ADC_INT_7_MSB                                   (3)
#define RG_DC_DAC_EN_7_ADDR                                (0x03B8)
#define RG_DC_DAC_EN_7_LSB                                 (4)
#define RG_DC_DAC_EN_7_MSB                                 (4)
#define RG_AMB_DAC_EN_7_ADDR                               (0x03B8)
#define RG_AMB_DAC_EN_7_LSB                                (5)
#define RG_AMB_DAC_EN_7_MSB                                (5)
#define RG_BG_LEVEL_7_ADDR                                 (0x03B8)
#define RG_BG_LEVEL_7_LSB                                  (6)
#define RG_BG_LEVEL_7_MSB                                  (7)
#define RG_RX0_TIA_GAIN_7_ADDR                             (0x03B8)
#define RG_RX0_TIA_GAIN_7_LSB                              (8)
#define RG_RX0_TIA_GAIN_7_MSB                              (10)
#define RG_RX1_TIA_GAIN_7_ADDR                             (0x03B8)
#define RG_RX1_TIA_GAIN_7_LSB                              (12)
#define RG_RX1_TIA_GAIN_7_MSB                              (14)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_7_ADDR                (0x03B8)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_7_LSB                 (15)
#define RG_BG_LEVEL0_LED_POW_HIGH_EN_7_MSB                 (15)
#define RG_RX0_TIA_CF_0_ADDR                               (0x03BA)
#define RG_RX0_TIA_CF_0_LSB                                (0)
#define RG_RX0_TIA_CF_0_MSB                                (1)
#define RG_RX1_TIA_CF_0_ADDR                               (0x03BA)
#define RG_RX1_TIA_CF_0_LSB                                (2)
#define RG_RX1_TIA_CF_0_MSB                                (3)
#define RG_RX0_BG_CANCEL_RANGE_0_ADDR                      (0x03BA)
#define RG_RX0_BG_CANCEL_RANGE_0_LSB                       (4)
#define RG_RX0_BG_CANCEL_RANGE_0_MSB                       (5)
#define RG_RX1_BG_CANCEL_RANGE_0_ADDR                      (0x03BA)
#define RG_RX1_BG_CANCEL_RANGE_0_LSB                       (6)
#define RG_RX1_BG_CANCEL_RANGE_0_MSB                       (7)
#define RG_BG_CANCEL_TRY_SKIP_0_ADDR                       (0x03BA)
#define RG_BG_CANCEL_TRY_SKIP_0_LSB                        (8)
#define RG_BG_CANCEL_TRY_SKIP_0_MSB                        (8)
#define RG_TIMING_TIA_SET_SEL_0_ADDR                       (0x03BA)
#define RG_TIMING_TIA_SET_SEL_0_LSB                        (12)
#define RG_TIMING_TIA_SET_SEL_0_MSB                        (14)
#define RG_RX0_TIA_CF_1_ADDR                               (0x03BC)
#define RG_RX0_TIA_CF_1_LSB                                (0)
#define RG_RX0_TIA_CF_1_MSB                                (1)
#define RG_RX1_TIA_CF_1_ADDR                               (0x03BC)
#define RG_RX1_TIA_CF_1_LSB                                (2)
#define RG_RX1_TIA_CF_1_MSB                                (3)
#define RG_RX0_BG_CANCEL_RANGE_1_ADDR                      (0x03BC)
#define RG_RX0_BG_CANCEL_RANGE_1_LSB                       (4)
#define RG_RX0_BG_CANCEL_RANGE_1_MSB                       (5)
#define RG_RX1_BG_CANCEL_RANGE_1_ADDR                      (0x03BC)
#define RG_RX1_BG_CANCEL_RANGE_1_LSB                       (6)
#define RG_RX1_BG_CANCEL_RANGE_1_MSB                       (7)
#define RG_BG_CANCEL_TRY_SKIP_1_ADDR                       (0x03BC)
#define RG_BG_CANCEL_TRY_SKIP_1_LSB                        (8)
#define RG_BG_CANCEL_TRY_SKIP_1_MSB                        (8)
#define RG_TIMING_TIA_SET_SEL_1_ADDR                       (0x03BC)
#define RG_TIMING_TIA_SET_SEL_1_LSB                        (12)
#define RG_TIMING_TIA_SET_SEL_1_MSB                        (14)
#define RG_RX0_TIA_CF_2_ADDR                               (0x03BE)
#define RG_RX0_TIA_CF_2_LSB                                (0)
#define RG_RX0_TIA_CF_2_MSB                                (1)
#define RG_RX1_TIA_CF_2_ADDR                               (0x03BE)
#define RG_RX1_TIA_CF_2_LSB                                (2)
#define RG_RX1_TIA_CF_2_MSB                                (3)
#define RG_RX0_BG_CANCEL_RANGE_2_ADDR                      (0x03BE)
#define RG_RX0_BG_CANCEL_RANGE_2_LSB                       (4)
#define RG_RX0_BG_CANCEL_RANGE_2_MSB                       (5)
#define RG_RX1_BG_CANCEL_RANGE_2_ADDR                      (0x03BE)
#define RG_RX1_BG_CANCEL_RANGE_2_LSB                       (6)
#define RG_RX1_BG_CANCEL_RANGE_2_MSB                       (7)
#define RG_BG_CANCEL_TRY_SKIP_2_ADDR                       (0x03BE)
#define RG_BG_CANCEL_TRY_SKIP_2_LSB                        (8)
#define RG_BG_CANCEL_TRY_SKIP_2_MSB                        (8)
#define RG_TIMING_TIA_SET_SEL_2_ADDR                       (0x03BE)
#define RG_TIMING_TIA_SET_SEL_2_LSB                        (12)
#define RG_TIMING_TIA_SET_SEL_2_MSB                        (14)
#define RG_RX0_TIA_CF_3_ADDR                               (0x03C0)
#define RG_RX0_TIA_CF_3_LSB                                (0)
#define RG_RX0_TIA_CF_3_MSB                                (1)
#define RG_RX1_TIA_CF_3_ADDR                               (0x03C0)
#define RG_RX1_TIA_CF_3_LSB                                (2)
#define RG_RX1_TIA_CF_3_MSB                                (3)
#define RG_RX0_BG_CANCEL_RANGE_3_ADDR                      (0x03C0)
#define RG_RX0_BG_CANCEL_RANGE_3_LSB                       (4)
#define RG_RX0_BG_CANCEL_RANGE_3_MSB                       (5)
#define RG_RX1_BG_CANCEL_RANGE_3_ADDR                      (0x03C0)
#define RG_RX1_BG_CANCEL_RANGE_3_LSB                       (6)
#define RG_RX1_BG_CANCEL_RANGE_3_MSB                       (7)
#define RG_BG_CANCEL_TRY_SKIP_3_ADDR                       (0x03C0)
#define RG_BG_CANCEL_TRY_SKIP_3_LSB                        (8)
#define RG_BG_CANCEL_TRY_SKIP_3_MSB                        (8)
#define RG_TIMING_TIA_SET_SEL_3_ADDR                       (0x03C0)
#define RG_TIMING_TIA_SET_SEL_3_LSB                        (12)
#define RG_TIMING_TIA_SET_SEL_3_MSB                        (14)
#define RG_RX0_TIA_CF_4_ADDR                               (0x03C2)
#define RG_RX0_TIA_CF_4_LSB                                (0)
#define RG_RX0_TIA_CF_4_MSB                                (1)
#define RG_RX1_TIA_CF_4_ADDR                               (0x03C2)
#define RG_RX1_TIA_CF_4_LSB                                (2)
#define RG_RX1_TIA_CF_4_MSB                                (3)
#define RG_RX0_BG_CANCEL_RANGE_4_ADDR                      (0x03C2)
#define RG_RX0_BG_CANCEL_RANGE_4_LSB                       (4)
#define RG_RX0_BG_CANCEL_RANGE_4_MSB                       (5)
#define RG_RX1_BG_CANCEL_RANGE_4_ADDR                      (0x03C2)
#define RG_RX1_BG_CANCEL_RANGE_4_LSB                       (6)
#define RG_RX1_BG_CANCEL_RANGE_4_MSB                       (7)
#define RG_BG_CANCEL_TRY_SKIP_4_ADDR                       (0x03C2)
#define RG_BG_CANCEL_TRY_SKIP_4_LSB                        (8)
#define RG_BG_CANCEL_TRY_SKIP_4_MSB                        (8)
#define RG_TIMING_TIA_SET_SEL_4_ADDR                       (0x03C2)
#define RG_TIMING_TIA_SET_SEL_4_LSB                        (12)
#define RG_TIMING_TIA_SET_SEL_4_MSB                        (14)
#define RG_RX0_TIA_CF_5_ADDR                               (0x03C4)
#define RG_RX0_TIA_CF_5_LSB                                (0)
#define RG_RX0_TIA_CF_5_MSB                                (1)
#define RG_RX1_TIA_CF_5_ADDR                               (0x03C4)
#define RG_RX1_TIA_CF_5_LSB                                (2)
#define RG_RX1_TIA_CF_5_MSB                                (3)
#define RG_RX0_BG_CANCEL_RANGE_5_ADDR                      (0x03C4)
#define RG_RX0_BG_CANCEL_RANGE_5_LSB                       (4)
#define RG_RX0_BG_CANCEL_RANGE_5_MSB                       (5)
#define RG_RX1_BG_CANCEL_RANGE_5_ADDR                      (0x03C4)
#define RG_RX1_BG_CANCEL_RANGE_5_LSB                       (6)
#define RG_RX1_BG_CANCEL_RANGE_5_MSB                       (7)
#define RG_BG_CANCEL_TRY_SKIP_5_ADDR                       (0x03C4)
#define RG_BG_CANCEL_TRY_SKIP_5_LSB                        (8)
#define RG_BG_CANCEL_TRY_SKIP_5_MSB                        (8)
#define RG_TIMING_TIA_SET_SEL_5_ADDR                       (0x03C4)
#define RG_TIMING_TIA_SET_SEL_5_LSB                        (12)
#define RG_TIMING_TIA_SET_SEL_5_MSB                        (14)
#define RG_RX0_TIA_CF_6_ADDR                               (0x03C6)
#define RG_RX0_TIA_CF_6_LSB                                (0)
#define RG_RX0_TIA_CF_6_MSB                                (1)
#define RG_RX1_TIA_CF_6_ADDR                               (0x03C6)
#define RG_RX1_TIA_CF_6_LSB                                (2)
#define RG_RX1_TIA_CF_6_MSB                                (3)
#define RG_RX0_BG_CANCEL_RANGE_6_ADDR                      (0x03C6)
#define RG_RX0_BG_CANCEL_RANGE_6_LSB                       (4)
#define RG_RX0_BG_CANCEL_RANGE_6_MSB                       (5)
#define RG_RX1_BG_CANCEL_RANGE_6_ADDR                      (0x03C6)
#define RG_RX1_BG_CANCEL_RANGE_6_LSB                       (6)
#define RG_RX1_BG_CANCEL_RANGE_6_MSB                       (7)
#define RG_BG_CANCEL_TRY_SKIP_6_ADDR                       (0x03C6)
#define RG_BG_CANCEL_TRY_SKIP_6_LSB                        (8)
#define RG_BG_CANCEL_TRY_SKIP_6_MSB                        (8)
#define RG_TIMING_TIA_SET_SEL_6_ADDR                       (0x03C6)
#define RG_TIMING_TIA_SET_SEL_6_LSB                        (12)
#define RG_TIMING_TIA_SET_SEL_6_MSB                        (14)
#define RG_RX0_TIA_CF_7_ADDR                               (0x03C8)
#define RG_RX0_TIA_CF_7_LSB                                (0)
#define RG_RX0_TIA_CF_7_MSB                                (1)
#define RG_RX1_TIA_CF_7_ADDR                               (0x03C8)
