wdxm657/esp32c3_gh3036_8/components/gh3036_sdk/gh_hal/hw_interface/inc/gh3036_reg.h
#define RG_RX1_TIA_CF_7_LSB                                (2)
#define RG_RX1_TIA_CF_7_MSB                                (3)
#define RG_RX0_BG_CANCEL_RANGE_7_ADDR                      (0x03C8)
#define RG_RX0_BG_CANCEL_RANGE_7_LSB                       (4)
#define RG_RX0_BG_CANCEL_RANGE_7_MSB                       (5)
#define RG_RX1_BG_CANCEL_RANGE_7_ADDR                      (0x03C8)
#define RG_RX1_BG_CANCEL_RANGE_7_LSB                       (6)
#define RG_RX1_BG_CANCEL_RANGE_7_MSB                       (7)
#define RG_BG_CANCEL_TRY_SKIP_7_ADDR                       (0x03C8)
#define RG_BG_CANCEL_TRY_SKIP_7_LSB                        (8)
#define RG_BG_CANCEL_TRY_SKIP_7_MSB                        (8)
#define RG_TIMING_TIA_SET_SEL_7_ADDR                       (0x03C8)
#define RG_TIMING_TIA_SET_SEL_7_LSB                        (12)
#define RG_TIMING_TIA_SET_SEL_7_MSB                        (14)
#define RG_RX0_DC_CANCEL_CODE_0_ADDR                       (0x03CA)
#define RG_RX0_DC_CANCEL_CODE_0_LSB                        (0)
#define RG_RX0_DC_CANCEL_CODE_0_MSB                        (7)
#define RG_RX1_DC_CANCEL_CODE_0_ADDR                       (0x03CA)
#define RG_RX1_DC_CANCEL_CODE_0_LSB                        (8)
#define RG_RX1_DC_CANCEL_CODE_0_MSB                        (15)
#define RG_RX0_DC_CANCEL_CODE_1_ADDR                       (0x03CC)
#define RG_RX0_DC_CANCEL_CODE_1_LSB                        (0)
#define RG_RX0_DC_CANCEL_CODE_1_MSB                        (7)
#define RG_RX1_DC_CANCEL_CODE_1_ADDR                       (0x03CC)
#define RG_RX1_DC_CANCEL_CODE_1_LSB                        (8)
#define RG_RX1_DC_CANCEL_CODE_1_MSB                        (15)
#define RG_RX0_DC_CANCEL_CODE_2_ADDR                       (0x03CE)
#define RG_RX0_DC_CANCEL_CODE_2_LSB                        (0)
#define RG_RX0_DC_CANCEL_CODE_2_MSB                        (7)
#define RG_RX1_DC_CANCEL_CODE_2_ADDR                       (0x03CE)
#define RG_RX1_DC_CANCEL_CODE_2_LSB                        (8)
#define RG_RX1_DC_CANCEL_CODE_2_MSB                        (15)
#define RG_RX0_DC_CANCEL_CODE_3_ADDR                       (0x03D0)
#define RG_RX0_DC_CANCEL_CODE_3_LSB                        (0)
#define RG_RX0_DC_CANCEL_CODE_3_MSB                        (7)
#define RG_RX1_DC_CANCEL_CODE_3_ADDR                       (0x03D0)
#define RG_RX1_DC_CANCEL_CODE_3_LSB                        (8)
#define RG_RX1_DC_CANCEL_CODE_3_MSB                        (15)
#define RG_RX0_DC_CANCEL_CODE_4_ADDR                       (0x03D2)
#define RG_RX0_DC_CANCEL_CODE_4_LSB                        (0)
#define RG_RX0_DC_CANCEL_CODE_4_MSB                        (7)
#define RG_RX1_DC_CANCEL_CODE_4_ADDR                       (0x03D2)
#define RG_RX1_DC_CANCEL_CODE_4_LSB                        (8)
#define RG_RX1_DC_CANCEL_CODE_4_MSB                        (15)
#define RG_RX0_DC_CANCEL_CODE_5_ADDR                       (0x03D4)
#define RG_RX0_DC_CANCEL_CODE_5_LSB                        (0)
#define RG_RX0_DC_CANCEL_CODE_5_MSB                        (7)
#define RG_RX1_DC_CANCEL_CODE_5_ADDR                       (0x03D4)
#define RG_RX1_DC_CANCEL_CODE_5_LSB                        (8)
#define RG_RX1_DC_CANCEL_CODE_5_MSB                        (15)
#define RG_RX0_DC_CANCEL_CODE_6_ADDR                       (0x03D6)
#define RG_RX0_DC_CANCEL_CODE_6_LSB                        (0)
#define RG_RX0_DC_CANCEL_CODE_6_MSB                        (7)
#define RG_RX1_DC_CANCEL_CODE_6_ADDR                       (0x03D6)
#define RG_RX1_DC_CANCEL_CODE_6_LSB                        (8)
#define RG_RX1_DC_CANCEL_CODE_6_MSB                        (15)
#define RG_RX0_DC_CANCEL_CODE_7_ADDR                       (0x03D8)
#define RG_RX0_DC_CANCEL_CODE_7_LSB                        (0)
#define RG_RX0_DC_CANCEL_CODE_7_MSB                        (7)
#define RG_RX1_DC_CANCEL_CODE_7_ADDR                       (0x03D8)
#define RG_RX1_DC_CANCEL_CODE_7_LSB                        (8)
#define RG_RX1_DC_CANCEL_CODE_7_MSB                        (15)
#define RG_RX0_DC_CANCEL_RANGE_0_ADDR                      (0x03DA)
#define RG_RX0_DC_CANCEL_RANGE_0_LSB                       (0)
#define RG_RX0_DC_CANCEL_RANGE_0_MSB                       (1)
#define RG_RX1_DC_CANCEL_RANGE_0_ADDR                      (0x03DA)
#define RG_RX1_DC_CANCEL_RANGE_0_LSB                       (2)
#define RG_RX1_DC_CANCEL_RANGE_0_MSB                       (3)
#define RG_SLOT_INNER_DELAY_0_ADDR                         (0x03DA)
#define RG_SLOT_INNER_DELAY_0_LSB                          (4)
#define RG_SLOT_INNER_DELAY_0_MSB                          (4)
#define RG_SLOT_POST_DELAY_0_ADDR                          (0x03DA)
#define RG_SLOT_POST_DELAY_0_LSB                           (5)
#define RG_SLOT_POST_DELAY_0_MSB                           (5)
#define RG_LED_DRV0_MAP_0_ADDR                             (0x03DA)
#define RG_LED_DRV0_MAP_0_LSB                              (8)
#define RG_LED_DRV0_MAP_0_MSB                              (9)
#define RG_LED_DRV1_MAP_0_ADDR                             (0x03DA)
#define RG_LED_DRV1_MAP_0_LSB                              (10)
#define RG_LED_DRV1_MAP_0_MSB                              (11)
#define RG_LEDDRV_HS_SW_0_ADDR                             (0x03DA)
#define RG_LEDDRV_HS_SW_0_LSB                              (12)
#define RG_LEDDRV_HS_SW_0_MSB                              (13)
#define RG_LED_POW_DELAY_NUM_0_ADDR                        (0x03DA)
#define RG_LED_POW_DELAY_NUM_0_LSB                         (14)
#define RG_LED_POW_DELAY_NUM_0_MSB                         (15)
#define RG_RX0_DC_CANCEL_RANGE_1_ADDR                      (0x03DC)
#define RG_RX0_DC_CANCEL_RANGE_1_LSB                       (0)
#define RG_RX0_DC_CANCEL_RANGE_1_MSB                       (1)
#define RG_RX1_DC_CANCEL_RANGE_1_ADDR                      (0x03DC)
#define RG_RX1_DC_CANCEL_RANGE_1_LSB                       (2)
#define RG_RX1_DC_CANCEL_RANGE_1_MSB                       (3)
#define RG_SLOT_INNER_DELAY_1_ADDR                         (0x03DC)
#define RG_SLOT_INNER_DELAY_1_LSB                          (4)
#define RG_SLOT_INNER_DELAY_1_MSB                          (4)
#define RG_SLOT_POST_DELAY_1_ADDR                          (0x03DC)
#define RG_SLOT_POST_DELAY_1_LSB                           (5)
#define RG_SLOT_POST_DELAY_1_MSB                           (5)
#define RG_LED_DRV0_MAP_1_ADDR                             (0x03DC)
#define RG_LED_DRV0_MAP_1_LSB                              (8)
#define RG_LED_DRV0_MAP_1_MSB                              (9)
#define RG_LED_DRV1_MAP_1_ADDR                             (0x03DC)
#define RG_LED_DRV1_MAP_1_LSB                              (10)
#define RG_LED_DRV1_MAP_1_MSB                              (11)
#define RG_LEDDRV_HS_SW_1_ADDR                             (0x03DC)
#define RG_LEDDRV_HS_SW_1_LSB                              (12)
#define RG_LEDDRV_HS_SW_1_MSB                              (13)
#define RG_LED_POW_DELAY_NUM_1_ADDR                        (0x03DC)
#define RG_LED_POW_DELAY_NUM_1_LSB                         (14)
#define RG_LED_POW_DELAY_NUM_1_MSB                         (15)
#define RG_RX0_DC_CANCEL_RANGE_2_ADDR                      (0x03DE)
#define RG_RX0_DC_CANCEL_RANGE_2_LSB                       (0)
#define RG_RX0_DC_CANCEL_RANGE_2_MSB                       (1)
#define RG_RX1_DC_CANCEL_RANGE_2_ADDR                      (0x03DE)
#define RG_RX1_DC_CANCEL_RANGE_2_LSB                       (2)
#define RG_RX1_DC_CANCEL_RANGE_2_MSB                       (3)
#define RG_SLOT_INNER_DELAY_2_ADDR                         (0x03DE)
#define RG_SLOT_INNER_DELAY_2_LSB                          (4)
#define RG_SLOT_INNER_DELAY_2_MSB                          (4)
#define RG_SLOT_POST_DELAY_2_ADDR                          (0x03DE)
#define RG_SLOT_POST_DELAY_2_LSB                           (5)
#define RG_SLOT_POST_DELAY_2_MSB                           (5)
#define RG_LED_DRV0_MAP_2_ADDR                             (0x03DE)
#define RG_LED_DRV0_MAP_2_LSB                              (8)
#define RG_LED_DRV0_MAP_2_MSB                              (9)
#define RG_LED_DRV1_MAP_2_ADDR                             (0x03DE)
#define RG_LED_DRV1_MAP_2_LSB                              (10)
#define RG_LED_DRV1_MAP_2_MSB                              (11)
#define RG_LEDDRV_HS_SW_2_ADDR                             (0x03DE)
#define RG_LEDDRV_HS_SW_2_LSB                              (12)
#define RG_LEDDRV_HS_SW_2_MSB                              (13)
#define RG_LED_POW_DELAY_NUM_2_ADDR                        (0x03DE)
#define RG_LED_POW_DELAY_NUM_2_LSB                         (14)
#define RG_LED_POW_DELAY_NUM_2_MSB                         (15)
#define RG_RX0_DC_CANCEL_RANGE_3_ADDR                      (0x03E0)
#define RG_RX0_DC_CANCEL_RANGE_3_LSB                       (0)
#define RG_RX0_DC_CANCEL_RANGE_3_MSB                       (1)
#define RG_RX1_DC_CANCEL_RANGE_3_ADDR                      (0x03E0)
#define RG_RX1_DC_CANCEL_RANGE_3_LSB                       (2)
#define RG_RX1_DC_CANCEL_RANGE_3_MSB                       (3)
#define RG_SLOT_INNER_DELAY_3_ADDR                         (0x03E0)
#define RG_SLOT_INNER_DELAY_3_LSB                          (4)
#define RG_SLOT_INNER_DELAY_3_MSB                          (4)
#define RG_SLOT_POST_DELAY_3_ADDR                          (0x03E0)
#define RG_SLOT_POST_DELAY_3_LSB                           (5)
#define RG_SLOT_POST_DELAY_3_MSB                           (5)
#define RG_LED_DRV0_MAP_3_ADDR                             (0x03E0)
#define RG_LED_DRV0_MAP_3_LSB                              (8)
#define RG_LED_DRV0_MAP_3_MSB                              (9)
#define RG_LED_DRV1_MAP_3_ADDR                             (0x03E0)
#define RG_LED_DRV1_MAP_3_LSB                              (10)
#define RG_LED_DRV1_MAP_3_MSB                              (11)
#define RG_LEDDRV_HS_SW_3_ADDR                             (0x03E0)
#define RG_LEDDRV_HS_SW_3_LSB                              (12)
#define RG_LEDDRV_HS_SW_3_MSB                              (13)
#define RG_LED_POW_DELAY_NUM_3_ADDR                        (0x03E0)
#define RG_LED_POW_DELAY_NUM_3_LSB                         (14)
#define RG_LED_POW_DELAY_NUM_3_MSB                         (15)
#define RG_RX0_DC_CANCEL_RANGE_4_ADDR                      (0x03E2)
#define RG_RX0_DC_CANCEL_RANGE_4_LSB                       (0)
#define RG_RX0_DC_CANCEL_RANGE_4_MSB                       (1)
#define RG_RX1_DC_CANCEL_RANGE_4_ADDR                      (0x03E2)
#define RG_RX1_DC_CANCEL_RANGE_4_LSB                       (2)
#define RG_RX1_DC_CANCEL_RANGE_4_MSB                       (3)
#define RG_SLOT_INNER_DELAY_4_ADDR                         (0x03E2)
#define RG_SLOT_INNER_DELAY_4_LSB                          (4)
#define RG_SLOT_INNER_DELAY_4_MSB                          (4)
#define RG_SLOT_POST_DELAY_4_ADDR                          (0x03E2)
#define RG_SLOT_POST_DELAY_4_LSB                           (5)
#define RG_SLOT_POST_DELAY_4_MSB                           (5)
#define RG_LED_DRV0_MAP_4_ADDR                             (0x03E2)
#define RG_LED_DRV0_MAP_4_LSB                              (8)
#define RG_LED_DRV0_MAP_4_MSB                              (9)
#define RG_LED_DRV1_MAP_4_ADDR                             (0x03E2)
#define RG_LED_DRV1_MAP_4_LSB                              (10)
#define RG_LED_DRV1_MAP_4_MSB                              (11)
#define RG_LEDDRV_HS_SW_4_ADDR                             (0x03E2)
#define RG_LEDDRV_HS_SW_4_LSB                              (12)
#define RG_LEDDRV_HS_SW_4_MSB                              (13)
#define RG_LED_POW_DELAY_NUM_4_ADDR                        (0x03E2)
#define RG_LED_POW_DELAY_NUM_4_LSB                         (14)
#define RG_LED_POW_DELAY_NUM_4_MSB                         (15)
#define RG_RX0_DC_CANCEL_RANGE_5_ADDR                      (0x03E4)
#define RG_RX0_DC_CANCEL_RANGE_5_LSB                       (0)
#define RG_RX0_DC_CANCEL_RANGE_5_MSB                       (1)
#define RG_RX1_DC_CANCEL_RANGE_5_ADDR                      (0x03E4)
#define RG_RX1_DC_CANCEL_RANGE_5_LSB                       (2)
#define RG_RX1_DC_CANCEL_RANGE_5_MSB                       (3)
#define RG_SLOT_INNER_DELAY_5_ADDR                         (0x03E4)
#define RG_SLOT_INNER_DELAY_5_LSB                          (4)
#define RG_SLOT_INNER_DELAY_5_MSB                          (4)
#define RG_SLOT_POST_DELAY_5_ADDR                          (0x03E4)
#define RG_SLOT_POST_DELAY_5_LSB                           (5)
#define RG_SLOT_POST_DELAY_5_MSB                           (5)
#define RG_LED_DRV0_MAP_5_ADDR                             (0x03E4)
#define RG_LED_DRV0_MAP_5_LSB                              (8)
#define RG_LED_DRV0_MAP_5_MSB                              (9)
#define RG_LED_DRV1_MAP_5_ADDR                             (0x03E4)
#define RG_LED_DRV1_MAP_5_LSB                              (10)
#define RG_LED_DRV1_MAP_5_MSB                              (11)
#define RG_LEDDRV_HS_SW_5_ADDR                             (0x03E4)
#define RG_LEDDRV_HS_SW_5_LSB                              (12)
#define RG_LEDDRV_HS_SW_5_MSB                              (13)
#define RG_LED_POW_DELAY_NUM_5_ADDR                        (0x03E4)
#define RG_LED_POW_DELAY_NUM_5_LSB                         (14)
#define RG_LED_POW_DELAY_NUM_5_MSB                         (15)
#define RG_RX0_DC_CANCEL_RANGE_6_ADDR                      (0x03E6)
#define RG_RX0_DC_CANCEL_RANGE_6_LSB                       (0)
#define RG_RX0_DC_CANCEL_RANGE_6_MSB                       (1)
#define RG_RX1_DC_CANCEL_RANGE_6_ADDR                      (0x03E6)
#define RG_RX1_DC_CANCEL_RANGE_6_LSB                       (2)
#define RG_RX1_DC_CANCEL_RANGE_6_MSB                       (3)
#define RG_SLOT_INNER_DELAY_6_ADDR                         (0x03E6)
#define RG_SLOT_INNER_DELAY_6_LSB                          (4)
#define RG_SLOT_INNER_DELAY_6_MSB                          (4)
#define RG_SLOT_POST_DELAY_6_ADDR                          (0x03E6)
#define RG_SLOT_POST_DELAY_6_LSB                           (5)
#define RG_SLOT_POST_DELAY_6_MSB                           (5)
#define RG_LED_DRV0_MAP_6_ADDR                             (0x03E6)
#define RG_LED_DRV0_MAP_6_LSB                              (8)
#define RG_LED_DRV0_MAP_6_MSB                              (9)
#define RG_LED_DRV1_MAP_6_ADDR                             (0x03E6)
#define RG_LED_DRV1_MAP_6_LSB                              (10)
#define RG_LED_DRV1_MAP_6_MSB                              (11)
#define RG_LEDDRV_HS_SW_6_ADDR                             (0x03E6)
#define RG_LEDDRV_HS_SW_6_LSB                              (12)
#define RG_LEDDRV_HS_SW_6_MSB                              (13)
#define RG_LED_POW_DELAY_NUM_6_ADDR                        (0x03E6)
#define RG_LED_POW_DELAY_NUM_6_LSB                         (14)
#define RG_LED_POW_DELAY_NUM_6_MSB                         (15)
#define RG_RX0_DC_CANCEL_RANGE_7_ADDR                      (0x03E8)
#define RG_RX0_DC_CANCEL_RANGE_7_LSB                       (0)
#define RG_RX0_DC_CANCEL_RANGE_7_MSB                       (1)
#define RG_RX1_DC_CANCEL_RANGE_7_ADDR                      (0x03E8)
#define RG_RX1_DC_CANCEL_RANGE_7_LSB                       (2)
#define RG_RX1_DC_CANCEL_RANGE_7_MSB                       (3)
#define RG_SLOT_INNER_DELAY_7_ADDR                         (0x03E8)
#define RG_SLOT_INNER_DELAY_7_LSB                          (4)
#define RG_SLOT_INNER_DELAY_7_MSB                          (4)
#define RG_SLOT_POST_DELAY_7_ADDR                          (0x03E8)
#define RG_SLOT_POST_DELAY_7_LSB                           (5)
#define RG_SLOT_POST_DELAY_7_MSB                           (5)
#define RG_LED_DRV0_MAP_7_ADDR                             (0x03E8)
#define RG_LED_DRV0_MAP_7_LSB                              (8)
#define RG_LED_DRV0_MAP_7_MSB                              (9)
#define RG_LED_DRV1_MAP_7_ADDR                             (0x03E8)
#define RG_LED_DRV1_MAP_7_LSB                              (10)
#define RG_LED_DRV1_MAP_7_MSB                              (11)
#define RG_LEDDRV_HS_SW_7_ADDR                             (0x03E8)
#define RG_LEDDRV_HS_SW_7_LSB                              (12)
#define RG_LEDDRV_HS_SW_7_MSB                              (13)
#define RG_LED_POW_DELAY_NUM_7_ADDR                        (0x03E8)
#define RG_LED_POW_DELAY_NUM_7_LSB                         (14)
#define RG_LED_POW_DELAY_NUM_7_MSB                         (15)
#define RG_LED_DRIVER0_CODE_0_ADDR                         (0x03EA)
#define RG_LED_DRIVER0_CODE_0_LSB                          (0)
#define RG_LED_DRIVER0_CODE_0_MSB                          (7)
#define RG_LED_DRIVER1_CODE_0_ADDR                         (0x03EA)
#define RG_LED_DRIVER1_CODE_0_LSB                          (8)
#define RG_LED_DRIVER1_CODE_0_MSB                          (15)
#define RG_LED_DRIVER0_CODE_1_ADDR                         (0x03EC)
#define RG_LED_DRIVER0_CODE_1_LSB                          (0)
#define RG_LED_DRIVER0_CODE_1_MSB                          (7)
#define RG_LED_DRIVER1_CODE_1_ADDR                         (0x03EC)
#define RG_LED_DRIVER1_CODE_1_LSB                          (8)
#define RG_LED_DRIVER1_CODE_1_MSB                          (15)
#define RG_LED_DRIVER0_CODE_2_ADDR                         (0x03EE)
#define RG_LED_DRIVER0_CODE_2_LSB                          (0)
#define RG_LED_DRIVER0_CODE_2_MSB                          (7)
#define RG_LED_DRIVER1_CODE_2_ADDR                         (0x03EE)
#define RG_LED_DRIVER1_CODE_2_LSB                          (8)
#define RG_LED_DRIVER1_CODE_2_MSB                          (15)
#define RG_LED_DRIVER0_CODE_3_ADDR                         (0x03F0)
#define RG_LED_DRIVER0_CODE_3_LSB                          (0)
#define RG_LED_DRIVER0_CODE_3_MSB                          (7)
#define RG_LED_DRIVER1_CODE_3_ADDR                         (0x03F0)
#define RG_LED_DRIVER1_CODE_3_LSB                          (8)
#define RG_LED_DRIVER1_CODE_3_MSB                          (15)
#define RG_LED_DRIVER0_CODE_4_ADDR                         (0x03F2)
#define RG_LED_DRIVER0_CODE_4_LSB                          (0)
#define RG_LED_DRIVER0_CODE_4_MSB                          (7)
#define RG_LED_DRIVER1_CODE_4_ADDR                         (0x03F2)
#define RG_LED_DRIVER1_CODE_4_LSB                          (8)
#define RG_LED_DRIVER1_CODE_4_MSB                          (15)
#define RG_LED_DRIVER0_CODE_5_ADDR                         (0x03F4)
#define RG_LED_DRIVER0_CODE_5_LSB                          (0)
#define RG_LED_DRIVER0_CODE_5_MSB                          (7)
#define RG_LED_DRIVER1_CODE_5_ADDR                         (0x03F4)
#define RG_LED_DRIVER1_CODE_5_LSB                          (8)
#define RG_LED_DRIVER1_CODE_5_MSB                          (15)
#define RG_LED_DRIVER0_CODE_6_ADDR                         (0x03F6)
#define RG_LED_DRIVER0_CODE_6_LSB                          (0)
#define RG_LED_DRIVER0_CODE_6_MSB                          (7)
#define RG_LED_DRIVER1_CODE_6_ADDR                         (0x03F6)
#define RG_LED_DRIVER1_CODE_6_LSB                          (8)
#define RG_LED_DRIVER1_CODE_6_MSB                          (15)
#define RG_LED_DRIVER0_CODE_7_ADDR                         (0x03F8)
#define RG_LED_DRIVER0_CODE_7_LSB                          (0)
#define RG_LED_DRIVER0_CODE_7_MSB                          (7)
#define RG_LED_DRIVER1_CODE_7_ADDR                         (0x03F8)
#define RG_LED_DRIVER1_CODE_7_LSB                          (8)
#define RG_LED_DRIVER1_CODE_7_MSB                          (15)
#define RG_DRE_EN_0_ADDR                                   (0x03FA)
#define RG_DRE_EN_0_LSB                                    (0)
#define RG_DRE_EN_0_MSB                                    (0)
#define RG_DRE_FIFO_OUTPUT_MODE_0_ADDR                     (0x03FA)
#define RG_DRE_FIFO_OUTPUT_MODE_0_LSB                      (1)
#define RG_DRE_FIFO_OUTPUT_MODE_0_MSB                      (1)
#define RG_DRE_SCALE_0_ADDR                                (0x03FA)
#define RG_DRE_SCALE_0_LSB                                 (4)
#define RG_DRE_SCALE_0_MSB                                 (6)
#define RG_DRE_CODE_CANCEL_0_ADDR                          (0x03FA)
#define RG_DRE_CODE_CANCEL_0_LSB                           (7)
#define RG_DRE_CODE_CANCEL_0_MSB                           (15)
#define RG_DRE_EN_1_ADDR                                   (0x03FC)
#define RG_DRE_EN_1_LSB                                    (0)
#define RG_DRE_EN_1_MSB                                    (0)
#define RG_DRE_FIFO_OUTPUT_MODE_1_ADDR                     (0x03FC)
#define RG_DRE_FIFO_OUTPUT_MODE_1_LSB                      (1)
#define RG_DRE_FIFO_OUTPUT_MODE_1_MSB                      (1)
#define RG_DRE_SCALE_1_ADDR                                (0x03FC)
#define RG_DRE_SCALE_1_LSB                                 (4)
#define RG_DRE_SCALE_1_MSB                                 (6)
#define RG_DRE_CODE_CANCEL_1_ADDR                          (0x03FC)
#define RG_DRE_CODE_CANCEL_1_LSB                           (7)
#define RG_DRE_CODE_CANCEL_1_MSB                           (15)
#define RG_DRE_EN_2_ADDR                                   (0x03FE)
#define RG_DRE_EN_2_LSB                                    (0)
#define RG_DRE_EN_2_MSB                                    (0)
#define RG_DRE_FIFO_OUTPUT_MODE_2_ADDR                     (0x03FE)
#define RG_DRE_FIFO_OUTPUT_MODE_2_LSB                      (1)
#define RG_DRE_FIFO_OUTPUT_MODE_2_MSB                      (1)
#define RG_DRE_SCALE_2_ADDR                                (0x03FE)
#define RG_DRE_SCALE_2_LSB                                 (4)
#define RG_DRE_SCALE_2_MSB                                 (6)
#define RG_DRE_CODE_CANCEL_2_ADDR                          (0x03FE)
#define RG_DRE_CODE_CANCEL_2_LSB                           (7)
#define RG_DRE_CODE_CANCEL_2_MSB                           (15)
#define RG_DRE_EN_3_ADDR                                   (0x0400)
#define RG_DRE_EN_3_LSB                                    (0)
#define RG_DRE_EN_3_MSB                                    (0)
#define RG_DRE_FIFO_OUTPUT_MODE_3_ADDR                     (0x0400)
#define RG_DRE_FIFO_OUTPUT_MODE_3_LSB                      (1)
#define RG_DRE_FIFO_OUTPUT_MODE_3_MSB                      (1)
#define RG_DRE_SCALE_3_ADDR                                (0x0400)
#define RG_DRE_SCALE_3_LSB                                 (4)
#define RG_DRE_SCALE_3_MSB                                 (6)
#define RG_DRE_CODE_CANCEL_3_ADDR                          (0x0400)
#define RG_DRE_CODE_CANCEL_3_LSB                           (7)
#define RG_DRE_CODE_CANCEL_3_MSB                           (15)
#define RG_DRE_EN_4_ADDR                                   (0x0402)
#define RG_DRE_EN_4_LSB                                    (0)
#define RG_DRE_EN_4_MSB                                    (0)
#define RG_DRE_FIFO_OUTPUT_MODE_4_ADDR                     (0x0402)
#define RG_DRE_FIFO_OUTPUT_MODE_4_LSB                      (1)
#define RG_DRE_FIFO_OUTPUT_MODE_4_MSB                      (1)
#define RG_DRE_SCALE_4_ADDR                                (0x0402)
#define RG_DRE_SCALE_4_LSB                                 (4)
#define RG_DRE_SCALE_4_MSB                                 (6)
#define RG_DRE_CODE_CANCEL_4_ADDR                          (0x0402)
#define RG_DRE_CODE_CANCEL_4_LSB                           (7)
#define RG_DRE_CODE_CANCEL_4_MSB                           (15)
#define RG_DRE_EN_5_ADDR                                   (0x0404)
#define RG_DRE_EN_5_LSB                                    (0)
