wdxm657/esp32c3_gh3036_8/components/gh3036_sdk/gh_hal/hw_interface/inc/gh3036_reg.h
#define RG_DRE_EN_5_MSB                                    (0)
#define RG_DRE_FIFO_OUTPUT_MODE_5_ADDR                     (0x0404)
#define RG_DRE_FIFO_OUTPUT_MODE_5_LSB                      (1)
#define RG_DRE_FIFO_OUTPUT_MODE_5_MSB                      (1)
#define RG_DRE_SCALE_5_ADDR                                (0x0404)
#define RG_DRE_SCALE_5_LSB                                 (4)
#define RG_DRE_SCALE_5_MSB                                 (6)
#define RG_DRE_CODE_CANCEL_5_ADDR                          (0x0404)
#define RG_DRE_CODE_CANCEL_5_LSB                           (7)
#define RG_DRE_CODE_CANCEL_5_MSB                           (15)
#define RG_DRE_EN_6_ADDR                                   (0x0406)
#define RG_DRE_EN_6_LSB                                    (0)
#define RG_DRE_EN_6_MSB                                    (0)
#define RG_DRE_FIFO_OUTPUT_MODE_6_ADDR                     (0x0406)
#define RG_DRE_FIFO_OUTPUT_MODE_6_LSB                      (1)
#define RG_DRE_FIFO_OUTPUT_MODE_6_MSB                      (1)
#define RG_DRE_SCALE_6_ADDR                                (0x0406)
#define RG_DRE_SCALE_6_LSB                                 (4)
#define RG_DRE_SCALE_6_MSB                                 (6)
#define RG_DRE_CODE_CANCEL_6_ADDR                          (0x0406)
#define RG_DRE_CODE_CANCEL_6_LSB                           (7)
#define RG_DRE_CODE_CANCEL_6_MSB                           (15)
#define RG_DRE_EN_7_ADDR                                   (0x0408)
#define RG_DRE_EN_7_LSB                                    (0)
#define RG_DRE_EN_7_MSB                                    (0)
#define RG_DRE_FIFO_OUTPUT_MODE_7_ADDR                     (0x0408)
#define RG_DRE_FIFO_OUTPUT_MODE_7_LSB                      (1)
#define RG_DRE_FIFO_OUTPUT_MODE_7_MSB                      (1)
#define RG_DRE_SCALE_7_ADDR                                (0x0408)
#define RG_DRE_SCALE_7_LSB                                 (4)
#define RG_DRE_SCALE_7_MSB                                 (6)
#define RG_DRE_CODE_CANCEL_7_ADDR                          (0x0408)
#define RG_DRE_CODE_CANCEL_7_LSB                           (7)
#define RG_DRE_CODE_CANCEL_7_MSB                           (15)
#define RG_CAP_SR_MULTIPLIER_ADDR                          (0x040A)
#define RG_CAP_SR_MULTIPLIER_LSB                           (0)
#define RG_CAP_SR_MULTIPLIER_MSB                           (8)
#define RG_CAP_ADC_INT_ADDR                                (0x040A)
#define RG_CAP_ADC_INT_LSB                                 (12)
#define RG_CAP_ADC_INT_MSB                                 (13)
#define RG_CAP_SLOT_POST_DELAY_ADDR                        (0x040A)
#define RG_CAP_SLOT_POST_DELAY_LSB                         (14)
#define RG_CAP_SLOT_POST_DELAY_MSB                         (15)
#define RG_PARAM_WRITE_START_ADDR                          (0x040C)
#define RG_PARAM_WRITE_START_LSB                           (0)
#define RG_PARAM_WRITE_START_MSB                           (0)
#define RG_PARAM_WRITE_END_ADDR                            (0x040C)
#define RG_PARAM_WRITE_END_LSB                             (1)
#define RG_PARAM_WRITE_END_MSB                             (1)
#define RG_PARAM_WAITING_TIMEOUT_SEL_ADDR                  (0x040C)
#define RG_PARAM_WAITING_TIMEOUT_SEL_LSB                   (2)
#define RG_PARAM_WAITING_TIMEOUT_SEL_MSB                   (3)
#define RG_CAP_CANCEL_EN_ADDR                              (0x040E)
#define RG_CAP_CANCEL_EN_LSB                               (0)
#define RG_CAP_CANCEL_EN_MSB                               (0)
#define RG_CANCEL_SCAN_PARAM_SEL_ADDR                      (0x040E)
#define RG_CANCEL_SCAN_PARAM_SEL_LSB                       (1)
#define RG_CANCEL_SCAN_PARAM_SEL_MSB                       (1)
#define RG_CANCEL_SCAN_START_ADDR                          (0x040E)
#define RG_CANCEL_SCAN_START_LSB                           (4)
#define RG_CANCEL_SCAN_START_MSB                           (13)
#define RG_CANCEL_SCAN_STEP_ADDR                           (0x0410)
#define RG_CANCEL_SCAN_STEP_LSB                            (0)
#define RG_CANCEL_SCAN_STEP_MSB                            (1)
#define RG_CANCEL_SCAN_END_ADDR                            (0x0410)
#define RG_CANCEL_SCAN_END_LSB                             (4)
#define RG_CANCEL_SCAN_END_MSB                             (13)
#define RG_TIA_SINGLE_EN_ADDR                              (0x0480)
#define RG_TIA_SINGLE_EN_LSB                               (0)
#define RG_TIA_SINGLE_EN_MSB                               (1)
#define RG_DAC_CHECK_TH_ADDR                               (0x0482)
#define RG_DAC_CHECK_TH_LSB                                (0)
#define RG_DAC_CHECK_TH_MSB                                (1)
#define RG_DAC_KDC_TH_CH1_ADDR                             (0x0482)
#define RG_DAC_KDC_TH_CH1_LSB                              (2)
#define RG_DAC_KDC_TH_CH1_MSB                              (4)
#define RG_DAC_KDC_TH_CH0_ADDR                             (0x0482)
#define RG_DAC_KDC_TH_CH0_LSB                              (5)
#define RG_DAC_KDC_TH_CH0_MSB                              (7)
#define RG_DAC_INV_ADDR                                    (0x0482)
#define RG_DAC_INV_LSB                                     (8)
#define RG_DAC_INV_MSB                                     (9)
#define RG_DAC_DC_INV_ADDR                                 (0x0482)
#define RG_DAC_DC_INV_LSB                                  (10)
#define RG_DAC_DC_INV_MSB                                  (11)
#define RG_ADC_XP_EN_ADDR                                  (0x0484)
#define RG_ADC_XP_EN_LSB                                   (0)
#define RG_ADC_XP_EN_MSB                                   (0)
#define RG_ADC_XP_SL_ADDR                                  (0x0484)
#define RG_ADC_XP_SL_LSB                                   (1)
#define RG_ADC_XP_SL_MSB                                   (1)
#define RG_LDOVREF_SL_ADDR                                 (0x0486)
#define RG_LDOVREF_SL_LSB                                  (0)
#define RG_LDOVREF_SL_MSB                                  (2)
#define RG_LPLDO_SL_ADDR                                   (0x0486)
#define RG_LPLDO_SL_LSB                                    (3)
#define RG_LPLDO_SL_MSB                                    (5)
#define RG_LEDDRV_FS_CH0_ADDR                              (0x0488)
#define RG_LEDDRV_FS_CH0_LSB                               (0)
#define RG_LEDDRV_FS_CH0_MSB                               (1)
#define RG_LEDDRV_FS_CH1_ADDR                              (0x0488)
#define RG_LEDDRV_FS_CH1_LSB                               (2)
#define RG_LEDDRV_FS_CH1_MSB                               (3)
#define RG_LEDDRV_VR_SEL_CH0_ADDR                          (0x0488)
#define RG_LEDDRV_VR_SEL_CH0_LSB                           (4)
#define RG_LEDDRV_VR_SEL_CH0_MSB                           (6)
#define RG_LEDDRV_VR_SEL_CH1_ADDR                          (0x0488)
#define RG_LEDDRV_VR_SEL_CH1_LSB                           (8)
#define RG_LEDDRV_VR_SEL_CH1_MSB                           (10)
#define RG_LEDDRV_DMY_ADDR                                 (0x0488)
#define RG_LEDDRV_DMY_LSB                                  (11)
#define RG_LEDDRV_DMY_MSB                                  (14)
#define RG_CAP_SLP_SEL_ADDR                                (0x048A)
#define RG_CAP_SLP_SEL_LSB                                 (0)
#define RG_CAP_SLP_SEL_MSB                                 (0)
#define RG_CAP_LNA_RES_TRIM_ADDR                           (0x048A)
#define RG_CAP_LNA_RES_TRIM_LSB                            (1)
#define RG_CAP_LNA_RES_TRIM_MSB                            (2)
#define RG_CAP_LPF_RES_SEL_ADDR                            (0x048A)
#define RG_CAP_LPF_RES_SEL_LSB                             (3)
#define RG_CAP_LPF_RES_SEL_MSB                             (4)
#define RG_CAP_RX_TX_EX_ADDR                               (0x048A)
#define RG_CAP_RX_TX_EX_LSB                                (5)
#define RG_CAP_RX_TX_EX_MSB                                (5)
#define RG_CAP_INTCAP_SEL_ADDR                             (0x048A)
#define RG_CAP_INTCAP_SEL_LSB                              (6)
#define RG_CAP_INTCAP_SEL_MSB                              (8)
#define RG_CAP_DAC2_EN_ADDR                                (0x048A)
#define RG_CAP_DAC2_EN_LSB                                 (9)
#define RG_CAP_DAC2_EN_MSB                                 (9)
#define RG_CAP_MUX_TEST_ADDR                               (0x048A)
#define RG_CAP_MUX_TEST_LSB                                (10)
#define RG_CAP_MUX_TEST_MSB                                (13)
#define RG_CAP_DAC1_REF_ADDR                               (0x048C)
#define RG_CAP_DAC1_REF_LSB                                (0)
#define RG_CAP_DAC1_REF_MSB                                (1)
#define RG_CAP_DAC2_REF_ADDR                               (0x048C)
#define RG_CAP_DAC2_REF_LSB                                (2)
#define RG_CAP_DAC2_REF_MSB                                (3)
#define RG_CAP_DUMMY0_ADDR                                 (0x048E)
#define RG_CAP_DUMMY0_LSB                                  (0)
#define RG_CAP_DUMMY0_MSB                                  (7)
#define RG_CAP_DUMMY1_ADDR                                 (0x048E)
#define RG_CAP_DUMMY1_LSB                                  (8)
#define RG_CAP_DUMMY1_MSB                                  (15)
#define RG_TIMING_TIA_QC_ADDR                              (0x0490)
#define RG_TIMING_TIA_QC_LSB                               (0)
#define RG_TIMING_TIA_QC_MSB                               (1)
#define RG_TIMING_DAC_KDC_ADDR                             (0x0490)
#define RG_TIMING_DAC_KDC_LSB                              (2)
#define RG_TIMING_DAC_KDC_MSB                              (4)
#define RG_TIMING_ADC_SET_ADDR                             (0x0490)
#define RG_TIMING_ADC_SET_LSB                              (5)
#define RG_TIMING_ADC_SET_MSB                              (6)
#define RG_TIMING_DPRO_ADDR                                (0x0490)
#define RG_TIMING_DPRO_LSB                                 (8)
#define RG_TIMING_DPRO_MSB                                 (9)
#define RG_TIMING_DAPRE_ADDR                               (0x0490)
#define RG_TIMING_DAPRE_LSB                                (10)
#define RG_TIMING_DAPRE_MSB                                (10)
#define RG_TIMING_KDCLOWR_ADDR                             (0x0492)
#define RG_TIMING_KDCLOWR_LSB                              (0)
#define RG_TIMING_KDCLOWR_MSB                              (1)
#define RG_TIMING_QCRST_ADDR                               (0x0492)
#define RG_TIMING_QCRST_LSB                                (2)
#define RG_TIMING_QCRST_MSB                                (2)
#define RG_TIMING_TIAPD_ADDR                               (0x0492)
#define RG_TIMING_TIAPD_LSB                                (3)
#define RG_TIMING_TIAPD_MSB                                (3)
#define RG_BG_CANCEL_MODE_ADDR                             (0x0492)
#define RG_BG_CANCEL_MODE_LSB                              (4)
#define RG_BG_CANCEL_MODE_MSB                              (4)
#define RG_BG_CANCEL_CODE_ADDR                             (0x0492)
#define RG_BG_CANCEL_CODE_LSB                              (8)
#define RG_BG_CANCEL_CODE_MSB                              (15)
#define RG_DRE_SAT_HANDLE_EN_ADDR                          (0x0494)
#define RG_DRE_SAT_HANDLE_EN_LSB                           (0)
#define RG_DRE_SAT_HANDLE_EN_MSB                           (0)
#define RG_DC_SLOT_EN_ADDR                                 (0x0494)
#define RG_DC_SLOT_EN_LSB                                  (1)
#define RG_DC_SLOT_EN_MSB                                  (1)
#define RG_DRE_RST_ADDR                                    (0x0494)
#define RG_DRE_RST_LSB                                     (2)
#define RG_DRE_RST_MSB                                     (2)
#define RG_TIA_PD_PULLD_SEL_ADDR                           (0x0494)
#define RG_TIA_PD_PULLD_SEL_LSB                            (3)
#define RG_TIA_PD_PULLD_SEL_MSB                            (4)
#define RG_DRE_CODE_MODE_ADDR                              (0x0494)
#define RG_DRE_CODE_MODE_LSB                               (5)
#define RG_DRE_CODE_MODE_MSB                               (5)
#define RG_DRE_DC_THR_ADDR                                 (0x0496)
#define RG_DRE_DC_THR_LSB                                  (0)
#define RG_DRE_DC_THR_MSB                                  (11)
#define RG_DRE_DC_THR_CNT_ADDR                             (0x0496)
#define RG_DRE_DC_THR_CNT_LSB                              (12)
#define RG_DRE_DC_THR_CNT_MSB                              (13)
#define RG_PPG_SA_THD_ADDR                                 (0x0498)
#define RG_PPG_SA_THD_LSB                                  (0)
#define RG_PPG_SA_THD_MSB                                  (11)
#define RG_T3_SET0_ADDR                                    (0x049A)
#define RG_T3_SET0_LSB                                     (0)
#define RG_T3_SET0_MSB                                     (3)
#define RG_T3_SET1_ADDR                                    (0x049A)
#define RG_T3_SET1_LSB                                     (4)
#define RG_T3_SET1_MSB                                     (7)
#define RG_TIMING_T1_ADDR                                  (0x049C)
#define RG_TIMING_T1_LSB                                   (0)
#define RG_TIMING_T1_MSB                                   (1)
#define RG_TIMING_T2_ADDR                                  (0x049C)
#define RG_TIMING_T2_LSB                                   (2)
#define RG_TIMING_T2_MSB                                   (3)
#define RG_TIMING_T3_ADDR                                  (0x049C)
#define RG_TIMING_T3_LSB                                   (4)
#define RG_TIMING_T3_MSB                                   (9)
#define RG_TIMING_T4_ADDR                                  (0x049E)
#define RG_TIMING_T4_LSB                                   (0)
#define RG_TIMING_T4_MSB                                   (8)
#define RG_TIMING_T5_ADDR                                  (0x049E)
#define RG_TIMING_T5_LSB                                   (9)
#define RG_TIMING_T5_MSB                                   (10)
#define RG_TIMING_T6_ADDR                                  (0x049E)
#define RG_TIMING_T6_LSB                                   (11)
#define RG_TIMING_T6_MSB                                   (13)
#define RG_TIMING_T7_ADDR                                  (0x04A0)
#define RG_TIMING_T7_LSB                                   (0)
#define RG_TIMING_T7_MSB                                   (2)
#define RG_TIMING_T8_ADDR                                  (0x04A0)
#define RG_TIMING_T8_LSB                                   (3)
#define RG_TIMING_T8_MSB                                   (4)
#define RG_CAP_CLK_DIV_FACTOR_ADDR                         (0x04A0)
#define RG_CAP_CLK_DIV_FACTOR_LSB                          (5)
#define RG_CAP_CLK_DIV_FACTOR_MSB                          (10)
#define RG_LNA_CANCEL_CODE_ADDR                            (0x04A2)
#define RG_LNA_CANCEL_CODE_LSB                             (0)
#define RG_LNA_CANCEL_CODE_MSB                             (9)
#define RG_SCI_CANCEL_CODE_ADDR                            (0x04A4)
#define RG_SCI_CANCEL_CODE_LSB                             (0)
#define RG_SCI_CANCEL_CODE_MSB                             (7)
#define RG_TEST_MODE_ADDR                                  (0x04A6)
#define RG_TEST_MODE_LSB                                   (0)
#define RG_TEST_MODE_MSB                                   (1)
#define RG_AFE_ADOM_EN_ADDR                                (0x04A6)
#define RG_AFE_ADOM_EN_LSB                                 (2)
#define RG_AFE_ADOM_EN_MSB                                 (2)
#define RG_TEST_ADC_CH_SEL_ADDR                            (0x04A6)
#define RG_TEST_ADC_CH_SEL_LSB                             (3)
#define RG_TEST_ADC_CH_SEL_MSB                             (3)
#define RG_TEST_TIA_POW_ADDR                               (0x04A8)
#define RG_TEST_TIA_POW_LSB                                (0)
#define RG_TEST_TIA_POW_MSB                                (1)
#define RG_TEST_TIA_QCN_ADDR                               (0x04A8)
#define RG_TEST_TIA_QCN_LSB                                (2)
#define RG_TEST_TIA_QCN_MSB                                (3)
#define RG_TEST_DAC_POW_ADDR                               (0x04A8)
#define RG_TEST_DAC_POW_LSB                                (4)
#define RG_TEST_DAC_POW_MSB                                (5)
#define RG_TEST_DAC_KDC_MODE_ADDR                          (0x04A8)
#define RG_TEST_DAC_KDC_MODE_LSB                           (6)
#define RG_TEST_DAC_KDC_MODE_MSB                           (7)
#define RG_TEST_DAC_KDC_POW_ADDR                           (0x04A8)
#define RG_TEST_DAC_KDC_POW_LSB                            (8)
#define RG_TEST_DAC_KDC_POW_MSB                            (9)
#define RG_TEST_ADC_BUF_POW_ADDR                           (0x04A8)
#define RG_TEST_ADC_BUF_POW_LSB                            (10)
#define RG_TEST_ADC_BUF_POW_MSB                            (11)
#define RG_TEST_ADC_POW_ADDR                               (0x04A8)
#define RG_TEST_ADC_POW_LSB                                (12)
#define RG_TEST_ADC_POW_MSB                                (13)
#define RG_TEST_ADC_RSTB_ADDR                              (0x04A8)
#define RG_TEST_ADC_RSTB_LSB                               (14)
#define RG_TEST_ADC_RSTB_MSB                               (15)
#define RG_TEST_LEDDRV_POW_ADDR                            (0x04AA)
#define RG_TEST_LEDDRV_POW_LSB                             (0)
#define RG_TEST_LEDDRV_POW_MSB                             (0)
#define RG_TEST_DAC_DC_POW_ADDR                            (0x04AA)
#define RG_TEST_DAC_DC_POW_LSB                             (2)
#define RG_TEST_DAC_DC_POW_MSB                             (3)
#define RG_TEST_LEDDRV_HS_SW_ADDR                          (0x04AA)
#define RG_TEST_LEDDRV_HS_SW_LSB                           (4)
#define RG_TEST_LEDDRV_HS_SW_MSB                           (5)
#define RG_TEST_DAC_CODE_CH0_ADDR                          (0x04AC)
#define RG_TEST_DAC_CODE_CH0_LSB                           (0)
#define RG_TEST_DAC_CODE_CH0_MSB                           (7)
#define RG_TEST_DAC_CODE_CH1_ADDR                          (0x04AC)
#define RG_TEST_DAC_CODE_CH1_LSB                           (8)
#define RG_TEST_DAC_CODE_CH1_MSB                           (15)
#define RG_TEST_TIA_RES_SL_CH0_ADDR                        (0x04AE)
#define RG_TEST_TIA_RES_SL_CH0_LSB                         (0)
#define RG_TEST_TIA_RES_SL_CH0_MSB                         (2)
#define RG_TEST_TIA_RES_SL_CH1_ADDR                        (0x04AE)
#define RG_TEST_TIA_RES_SL_CH1_LSB                         (4)
#define RG_TEST_TIA_RES_SL_CH1_MSB                         (6)
#define RG_TEST_TIA_CAP_SL_CH0_ADDR                        (0x04AE)
#define RG_TEST_TIA_CAP_SL_CH0_LSB                         (8)
#define RG_TEST_TIA_CAP_SL_CH0_MSB                         (11)
#define RG_TEST_TIA_CAP_SL_CH1_ADDR                        (0x04AE)
#define RG_TEST_TIA_CAP_SL_CH1_LSB                         (12)
#define RG_TEST_TIA_CAP_SL_CH1_MSB                         (15)
#define RG_TEST_DAC_DC_CODE_CH0_ADDR                       (0x04B0)
#define RG_TEST_DAC_DC_CODE_CH0_LSB                        (0)
#define RG_TEST_DAC_DC_CODE_CH0_MSB                        (7)
#define RG_TEST_DAC_DC_CODE_CH1_ADDR                       (0x04B0)
#define RG_TEST_DAC_DC_CODE_CH1_LSB                        (8)
#define RG_TEST_DAC_DC_CODE_CH1_MSB                        (15)
#define RG_TEST_CAP_SENSOR_POW_ADDR                        (0x04B2)
#define RG_TEST_CAP_SENSOR_POW_LSB                         (0)
#define RG_TEST_CAP_SENSOR_POW_MSB                         (0)
#define RG_TEST_CAP_SLEEP_EN_ADDR                          (0x04B2)
#define RG_TEST_CAP_SLEEP_EN_LSB                           (1)
#define RG_TEST_CAP_SLEEP_EN_MSB                           (1)
#define RG_TEST_CAP_EN_SW_ADDR                             (0x04B2)
#define RG_TEST_CAP_EN_SW_LSB                              (2)
#define RG_TEST_CAP_EN_SW_MSB                              (2)
#define RG_TEST_CAP_RST_ADDR                               (0x04B2)
#define RG_TEST_CAP_RST_LSB                                (3)
#define RG_TEST_CAP_RST_MSB                                (3)
#define RG_TEST_CAP_CK_GATE_ADDR                           (0x04B2)
#define RG_TEST_CAP_CK_GATE_LSB                            (4)
#define RG_TEST_CAP_CK_GATE_MSB                            (4)
#define RG_TEST_ADCBUF_MUX_CAP_ADDR                        (0x04B2)
#define RG_TEST_ADCBUF_MUX_CAP_LSB                         (5)
#define RG_TEST_ADCBUF_MUX_CAP_MSB                         (5)
#define RG_INT_ENABLE_ADDR                                 (0x0500)
#define RG_INT_ENABLE_LSB                                  (0)
#define RG_INT_ENABLE_MSB                                  (10)
#define RG_TIMER_SEL_ADDR                                  (0x0502)
#define RG_TIMER_SEL_LSB                                   (0)
#define RG_TIMER_SEL_MSB                                   (8)
#define RG_TIMER_MODE_ADDR                                 (0x0502)
#define RG_TIMER_MODE_LSB                                  (9)
#define RG_TIMER_MODE_MSB                                  (9)
#define RG_TIMER_ON_ADDR                                   (0x0502)
#define RG_TIMER_ON_LSB                                    (10)
#define RG_TIMER_ON_MSB                                    (10)
#define RG_USER_INT_TRIGGER_ADDR                           (0x0504)
#define RG_USER_INT_TRIGGER_LSB                            (0)
#define RG_USER_INT_TRIGGER_MSB                            (0)
#define RG_USER_INT_INFO_ADDR                              (0x0506)
#define RG_USER_INT_INFO_LSB                               (0)
#define RG_USER_INT_INFO_MSB                               (7)
#define RG_LDO_MONITOR_EN_ADDR                             (0x0508)
#define RG_LDO_MONITOR_EN_LSB                              (0)
#define RG_LDO_MONITOR_EN_MSB                              (0)
#define RG_INT_AFTER_FRAME_ADDR                            (0x050A)
#define RG_INT_AFTER_FRAME_LSB                             (0)
#define RG_INT_AFTER_FRAME_MSB                             (0)
#define RG_INT_LOW_EN_ADDR                                 (0x050C)
#define RG_INT_LOW_EN_LSB                                  (0)
#define RG_INT_LOW_EN_MSB                                  (0)
#define RG_INT_LEVEL_EN_ADDR                               (0x050E)
#define RG_INT_LEVEL_EN_LSB                                (0)
#define RG_INT_LEVEL_EN_MSB                                (0)
#define RG_INT_WIDTH_ADDR                                  (0x0510)
#define RG_INT_WIDTH_LSB                                   (0)
#define RG_INT_WIDTH_MSB                                   (10)
#define RG_COLD_TIME_ADDR                                  (0x0512)
#define RG_COLD_TIME_LSB                                   (0)
#define RG_COLD_TIME_MSB                                   (5)
#define RG_INT_CLR_ADDR                                    (0x0514)
#define RG_INT_CLR_LSB                                     (0)
#define RG_INT_CLR_MSB                                     (10)
#define INT_STATUS_ADDR                                    (0x0516)
#define INT_STATUS_LSB                                     (0)
#define INT_STATUS_MSB                                     (10)
