wdxm657/esp32c3_gh3036_8/components/gh3036_sdk/gh_hal/hw_interface/inc/gh3036_reg.h
#define RG_EFUSE_MODE_ADDR                                 (0x0580)
#define RG_EFUSE_MODE_LSB                                  (0)
#define RG_EFUSE_MODE_MSB                                  (0)
#define RG_EFUSE_REG_MODE_ADDR                             (0x0580)
#define RG_EFUSE_REG_MODE_LSB                              (1)
#define RG_EFUSE_REG_MODE_MSB                              (1)
#define RG_EFUSE_SEL_ADDR                                  (0x0580)
#define RG_EFUSE_SEL_LSB                                   (2)
#define RG_EFUSE_SEL_MSB                                   (3)
#define RG_EFUSE_PGMEN_ADDR                                (0x0582)
#define RG_EFUSE_PGMEN_LSB                                 (0)
#define RG_EFUSE_PGMEN_MSB                                 (0)
#define RG_EFUSE_RDEN_ADDR                                 (0x0584)
#define RG_EFUSE_RDEN_LSB                                  (0)
#define RG_EFUSE_RDEN_MSB                                  (0)
#define RG_EFUSE_AEN_ADDR                                  (0x0586)
#define RG_EFUSE_AEN_LSB                                   (0)
#define RG_EFUSE_AEN_MSB                                   (0)
#define RG_EFUSE_ADDR_ADDR                                 (0x0588)
#define RG_EFUSE_ADDR_LSB                                  (0)
#define RG_EFUSE_ADDR_MSB                                  (7)
#define RG_EFUSE_START_ADDR                                (0x058A)
#define RG_EFUSE_START_LSB                                 (0)
#define RG_EFUSE_START_MSB                                 (0)
#define RG_EFUSE_REFRESH_ADDR                              (0x058C)
#define RG_EFUSE_REFRESH_LSB                               (0)
#define RG_EFUSE_REFRESH_MSB                               (0)
#define RG_EFUSE_BLANK_EN_ADDR                             (0x058E)
#define RG_EFUSE_BLANK_EN_LSB                              (0)
#define RG_EFUSE_BLANK_EN_MSB                              (0)
#define RG_EFUSE_PASSWORD_ADDR                             (0x0590)
#define RG_EFUSE_PASSWORD_LSB                              (0)
#define RG_EFUSE_PASSWORD_MSB                              (15)
#define RG_EFUSE_TRD_ADDR                                  (0x0592)
#define RG_EFUSE_TRD_LSB                                   (0)
#define RG_EFUSE_TRD_MSB                                   (4)
#define RG_EFUSE_TPGM_ADDR                                 (0x0592)
#define RG_EFUSE_TPGM_LSB                                  (8)
#define RG_EFUSE_TPGM_MSB                                  (11)
#define RG_EFUSE_WDATA_0_ADDR                              (0x0594)
#define RG_EFUSE_WDATA_0_LSB                               (0)
#define RG_EFUSE_WDATA_0_MSB                               (15)
#define RG_EFUSE_WDATA_1_ADDR                              (0x0596)
#define RG_EFUSE_WDATA_1_LSB                               (0)
#define RG_EFUSE_WDATA_1_MSB                               (15)
#define RG_EFUSE_WDATA_2_ADDR                              (0x0598)
#define RG_EFUSE_WDATA_2_LSB                               (0)
#define RG_EFUSE_WDATA_2_MSB                               (15)
#define RG_EFUSE_WDATA_3_ADDR                              (0x059A)
#define RG_EFUSE_WDATA_3_LSB                               (0)
#define RG_EFUSE_WDATA_3_MSB                               (15)
#define RG_EFUSE_D_ADDR                                    (0x059C)
#define RG_EFUSE_D_LSB                                     (0)
#define RG_EFUSE_D_MSB                                     (7)
#define RG_EFUSE_RDATA_0_ADDR                              (0x059E)
#define RG_EFUSE_RDATA_0_LSB                               (0)
#define RG_EFUSE_RDATA_0_MSB                               (15)
#define RG_EFUSE_RDATA_1_ADDR                              (0x05A0)
#define RG_EFUSE_RDATA_1_LSB                               (0)
#define RG_EFUSE_RDATA_1_MSB                               (15)
#define RG_EFUSE_RDATA_2_ADDR                              (0x05A2)
#define RG_EFUSE_RDATA_2_LSB                               (0)
#define RG_EFUSE_RDATA_2_MSB                               (15)
#define RG_EFUSE_RDATA_3_ADDR                              (0x05A4)
#define RG_EFUSE_RDATA_3_LSB                               (0)
#define RG_EFUSE_RDATA_3_MSB                               (15)
#define RG_EFUSE_READ_DONE_MANUAL_ADDR                     (0x05A6)
#define RG_EFUSE_READ_DONE_MANUAL_LSB                      (0)
#define RG_EFUSE_READ_DONE_MANUAL_MSB                      (0)
#define RG_EFUSE_WRITE_DONE_MANUAL_ADDR                    (0x05A6)
#define RG_EFUSE_WRITE_DONE_MANUAL_LSB                     (1)
#define RG_EFUSE_WRITE_DONE_MANUAL_MSB                     (1)
#define RG_EFUSE_BLANK_DONE_ADDR                           (0x05A6)
#define RG_EFUSE_BLANK_DONE_LSB                            (2)
#define RG_EFUSE_BLANK_DONE_MSB                            (2)
#define RG_EFUSE_NO_BLANK_ADDR                             (0x05A6)
#define RG_EFUSE_NO_BLANK_LSB                              (3)
#define RG_EFUSE_NO_BLANK_MSB                              (3)
#define RG_EFUSE_AEN_DONE_ADDR                             (0x05A6)
#define RG_EFUSE_AEN_DONE_LSB                              (4)
#define RG_EFUSE_AEN_DONE_MSB                              (4)
#define RG_EFUSE_AUTOLOAD_DONE_ADDR                        (0x05A6)
#define RG_EFUSE_AUTOLOAD_DONE_LSB                         (5)
#define RG_EFUSE_AUTOLOAD_DONE_MSB                         (5)
#define RG_EFUSE_BUSY_ADDR                                 (0x05A6)
#define RG_EFUSE_BUSY_LSB                                  (6)
#define RG_EFUSE_BUSY_MSB                                  (6)
#define RG_SYNC_POLAR_SEL_ADDR                             (0x0600)
#define RG_SYNC_POLAR_SEL_LSB                              (0)
#define RG_SYNC_POLAR_SEL_MSB                              (0)
#define RG_SYNC_PIN_SEL_ADDR                               (0x0600)
#define RG_SYNC_PIN_SEL_LSB                                (1)
#define RG_SYNC_PIN_SEL_MSB                                (2)
#define RG_WT_EN_ADDR                                      (0x0600)
#define RG_WT_EN_LSB                                       (4)
#define RG_WT_EN_MSB                                       (4)
#define RG_WT_SEL_ADDR                                     (0x0600)
#define RG_WT_SEL_LSB                                      (5)
#define RG_WT_SEL_MSB                                      (5)
#define RG_I2C_SLAVE_ID_EN_ADDR                            (0x0600)
#define RG_I2C_SLAVE_ID_EN_LSB                             (6)
#define RG_I2C_SLAVE_ID_EN_MSB                             (6)
#define RG_CLK13M_SEL_INT_ADDR                             (0x0600)
#define RG_CLK13M_SEL_INT_LSB                              (7)
#define RG_CLK13M_SEL_INT_MSB                              (7)
#define RG_CLK32K_OUT_EN_ADDR                              (0x0600)
#define RG_CLK32K_OUT_EN_LSB                               (8)
#define RG_CLK32K_OUT_EN_MSB                               (8)
#define RG_CLK32K_SEL_ADDR                                 (0x0600)
#define RG_CLK32K_SEL_LSB                                  (9)
#define RG_CLK32K_SEL_MSB                                  (9)
#define RG_MPX0_EN_ADDR                                    (0x0600)
#define RG_MPX0_EN_LSB                                     (10)
#define RG_MPX0_EN_MSB                                     (10)
#define RG_MPX1_EN_ADDR                                    (0x0600)
#define RG_MPX1_EN_LSB                                     (11)
#define RG_MPX1_EN_MSB                                     (11)
#define RG_GPIO_EN_ADDR                                    (0x0602)
#define RG_GPIO_EN_LSB                                     (0)
#define RG_GPIO_EN_MSB                                     (3)
#define RG_GPIO0_IOUT_ADDR                                 (0x0602)
#define RG_GPIO0_IOUT_LSB                                  (4)
#define RG_GPIO0_IOUT_MSB                                  (4)
#define RG_GPIO1_IOUT_ADDR                                 (0x0602)
#define RG_GPIO1_IOUT_LSB                                  (6)
#define RG_GPIO1_IOUT_MSB                                  (6)
#define RG_GPIO_OSC_IOUT_ADDR                              (0x0602)
#define RG_GPIO_OSC_IOUT_LSB                               (8)
#define RG_GPIO_OSC_IOUT_MSB                               (8)
#define RG_GPIO_INT_IOUT_ADDR                              (0x0602)
#define RG_GPIO_INT_IOUT_LSB                               (10)
#define RG_GPIO_INT_IOUT_MSB                               (10)
#define RG_PAD_SPI_CLK_CTRL_ADDR                           (0x0604)
#define RG_PAD_SPI_CLK_CTRL_LSB                            (0)
#define RG_PAD_SPI_CLK_CTRL_MSB                            (2)
#define RG_PAD_SPI_MISO_CTRL_ADDR                          (0x0604)
#define RG_PAD_SPI_MISO_CTRL_LSB                           (3)
#define RG_PAD_SPI_MISO_CTRL_MSB                           (6)
#define RG_PAD_SPI_MOSI_CTRL_ADDR                          (0x0604)
#define RG_PAD_SPI_MOSI_CTRL_LSB                           (7)
#define RG_PAD_SPI_MOSI_CTRL_MSB                           (9)
#define RG_PAD_SPI_CSN_CTRL_ADDR                           (0x0604)
#define RG_PAD_SPI_CSN_CTRL_LSB                            (10)
#define RG_PAD_SPI_CSN_CTRL_MSB                            (12)
#define RG_PAD_I2C_SCL_CTRL_ADDR                           (0x0606)
#define RG_PAD_I2C_SCL_CTRL_LSB                            (0)
#define RG_PAD_I2C_SCL_CTRL_MSB                            (2)
#define RG_PAD_I2C_SDA_CTRL_ADDR                           (0x0606)
#define RG_PAD_I2C_SDA_CTRL_LSB                            (3)
#define RG_PAD_I2C_SDA_CTRL_MSB                            (5)
#define RG_PAD_I2C_SID1_CTRL_ADDR                          (0x0606)
#define RG_PAD_I2C_SID1_CTRL_LSB                           (6)
#define RG_PAD_I2C_SID1_CTRL_MSB                           (8)
#define RG_PAD_I2C_SID0_CTRL_ADDR                          (0x0606)
#define RG_PAD_I2C_SID0_CTRL_LSB                           (9)
#define RG_PAD_I2C_SID0_CTRL_MSB                           (11)
#define RG_PAD_OSC_CTRL_ADDR                               (0x0608)
#define RG_PAD_OSC_CTRL_LSB                                (0)
#define RG_PAD_OSC_CTRL_MSB                                (2)
#define RG_PAD_INT_CTRL_ADDR                               (0x0608)
#define RG_PAD_INT_CTRL_LSB                                (3)
#define RG_PAD_INT_CTRL_MSB                                (5)
#define RG_PAD_GPIO0_CTRL_ADDR                             (0x0608)
#define RG_PAD_GPIO0_CTRL_LSB                              (6)
#define RG_PAD_GPIO0_CTRL_MSB                              (8)
#define RG_PAD_GPIO1_CTRL_ADDR                             (0x0608)
#define RG_PAD_GPIO1_CTRL_LSB                              (9)
#define RG_PAD_GPIO1_CTRL_MSB                              (11)
#define RG_CPHA_ADDR                                       (0x0680)
#define RG_CPHA_LSB                                        (0)
#define RG_CPHA_MSB                                        (0)
#define RG_CPOL_ADDR                                       (0x0680)
#define RG_CPOL_LSB                                        (1)
#define RG_CPOL_MSB                                        (1)
#define RG_DIGLITCH_BYPASS_ADDR                            (0x0680)
#define RG_DIGLITCH_BYPASS_LSB                             (2)
#define RG_DIGLITCH_BYPASS_MSB                             (2)
#define RG_I2CS_ID_ADDR                                    (0x0680)
#define RG_I2CS_ID_LSB                                     (3)
#define RG_I2CS_ID_MSB                                     (7)
#define RG_SPIS_CKGT_EN_ADDR                               (0x0680)
#define RG_SPIS_CKGT_EN_LSB                                (8)
#define RG_SPIS_CKGT_EN_MSB                                (8)
#define RG_I2CS_CKGT_EN_ADDR                               (0x0680)
#define RG_I2CS_CKGT_EN_LSB                                (9)
#define RG_I2CS_CKGT_EN_MSB                                (9)
#define RG_I2C_TIMEOUT_EN_ADDR                             (0x0680)
#define RG_I2C_TIMEOUT_EN_LSB                              (10)
#define RG_I2C_TIMEOUT_EN_MSB                              (10)


#ifdef __cplusplus
}
#endif

#endif /* __GH3036_REG_H__*/
